[
  {
    "id": "concept_1",
    "title": "Faith Healing",
    "description": "The belief that physical healing can come through faith in God, prayer, and in some traditions, specific healing ministers.",
    "biblicalNuance": "Scripture clearly shows God's power to heal and records many miraculous healings. Both Old and New Testaments contain accounts of divine healing through prayer and faith. However, the Bible never guarantees universal physical healing in this life for all believers, and shows faithful servants of God who remained ill (like Paul's \"thorn in the flesh\" and Timothy's stomach problems).",
    "commonAbuses": [
      "Promising guaranteed healing if someone has \"enough faith,\" creating guilt and spiritual confusion when healing doesn't occur.",
      "Discouraging or condemning the use of medical treatment as showing \"lack of faith.\"",
      "Treating healing as a formula or technique rather than God's sovereign gift.",
      "Using manipulative techniques to create the appearance of healing for financial gain or fame.",
      "Teaching that sickness is always the result of sin or lack of faith, contradicting biblical examples of godly people who suffered illness.",
      "Claiming that Christ's atonement guarantees physical healing in this life, misinterpreting Isaiah 53:5."
    ],
    "balancedPerspective": "Christians should confidently pray for healing while recognizing God's sovereignty. The Bible encourages bold prayers for healing while also showing that God sometimes allows suffering for purposes we may not understand. Faith means trusting God's goodness whether He chooses to heal physically or not. Medical treatment should be viewed as a gift from God, not opposed to faith. Ultimate healing comes in the resurrection, when believers receive glorified bodies free from all sickness and pain. God's primary concern is our spiritual health and conformity to Christ's image.",
    "relevantScriptures": [
      "James 5:14-16 - Instructions for elders to pray over the sick.",
      "2 Corinthians 12:7-10 - Paul's unanswered prayer for healing of his \"thorn in the flesh.\"",
      "1 Timothy 5:23 - Paul advises Timothy to use wine for his stomach problems rather than only seeking miraculous healing.",
      "Isaiah 53:5 - \"By his wounds we are healed\" - referring primarily to spiritual healing from sin, though with physical implications in the resurrection.",
      "Philippians 2:25-27 - Epaphroditus was sick and nearly died, showing that even faithful ministers can experience serious illness.",
      "2 Timothy 4:20 - Paul left Trophimus sick at Miletus, indicating healing was not always immediate or guaranteed."
    ]
  },
  {
    "id": "concept_2",
    "title": "Tithing",
    "description": "The practice of giving a tenth (10%) of one's income or produce to God, often through the local church.",
    "biblicalNuance": "The Old Testament established multiple tithes for Israelites under the Mosaic covenant, supporting Levites, festivals, and the poor. The New Testament never explicitly commands tithing for Christians but establishes principles of generous, cheerful, regular, and sacrificial giving. Early Christians gave according to ability and need, sometimes far beyond a tithe.",
    "commonAbuses": [
      "Teaching that tithing is a universal requirement for Christians with the same specific regulations as in ancient Israel.",
      "Promising specific financial returns/prosperity for those who tithe (a \"spiritual investment\").",
      "Using manipulation or guilt to extract tithes rather than encouraging cheerful giving.",
      "Focusing exclusively on percentage rather than heart attitude and generosity principles.",
      "Claiming that failure to tithe is \"robbing God\" based on Malachi 3:8, which was specifically addressed to covenant Israel.",
      "Teaching that tithing guarantees financial blessing or protection from financial hardship.",
      "Demanding tithes from the poor while church leaders live in luxury.",
      "Making church membership or spiritual standing contingent upon tithing compliance."
    ],
    "balancedPerspective": "While the specific Mosaic tithing regulations aren't binding on Christians, the principles behind tithing remain valid - God owns everything, giving should be proportional to income, and giving supports God's work. The New Testament calls for generous, sacrificial giving from the heart, not under compulsion. Tithing can be a helpful guideline or starting point for giving, but the emphasis should be on cheerful generosity according to ability, recognizing that everything we have belongs to God. Christian giving should be motivated by love and gratitude, not law or fear.",
    "relevantScriptures": [
      "2 Corinthians 9:6-7 - \"Each one must give as he has decided in his heart, not reluctantly or under compulsion, for God loves a cheerful giver.\"",
      "Acts 4:32-37 - Early Christians shared possessions according to need, with some selling property to support others.",
      "Matthew 23:23 - Jesus affirms tithing for those under the Law but emphasizes \"weightier matters.\"",
      "1 Corinthians 16:2 - Paul encourages regular, proportional giving \"as he may prosper.\"",
      "2 Corinthians 8:1-5 - Macedonian churches gave beyond their ability out of joy, not obligation.",
      "Luke 21:1-4 - The widow's mite shows that God values the heart behind giving more than the amount."
    ]
  },
  {
    "id": "concept_3",
    "title": "Spiritual Warfare",
    "description": "The Christian concept of struggle against evil spiritual forces, including Satan and demons.",
    "biblicalNuance": "Scripture affirms the reality of spiritual beings (angels, demons) and describes an ongoing conflict between God's kingdom and dark spiritual forces. The Bible shows Satan as a real adversary but a defeated one, with limited power and ultimately subject to God's authority. Christians are engaged in spiritual warfare but fight primarily through truth, righteousness, faith, prayer, and the word of God (Ephesians 6).",
    "commonAbuses": [
      "Attributing every problem, illness, or difficulty to direct demonic activity without considering natural causes.",
      "Developing elaborate \"spiritual warfare techniques\" not found in scripture, often focusing on territorial spirits or generational curses.",
      "Unhealthy fixation on demons rather than focus on Christ and His victory.",
      "Claiming authority to \"bind\" Satan or demons in ways that exceed biblical teaching.",
      "Teaching that Christians can be demon-possessed, contradicting the indwelling of the Holy Spirit.",
      "Promoting fear-based Christianity that sees demons behind every circumstance.",
      "Using spiritual warfare as an excuse for personal failures or lack of spiritual growth.",
      "Engaging in dramatic, theatrical \"deliverance\" ministries that lack biblical foundation."
    ],
    "balancedPerspective": "Christians should acknowledge the reality of spiritual warfare while avoiding both skepticism and unhealthy fascination. Scripture teaches us to resist the devil through submission to God, to put on the full armor of God, and to stand firm in faith. Spiritual warfare is real but is waged primarily through prayer, truth, righteousness, and proclamation of the gospel - not through formulaic pronouncements or dramatic rituals. Our focus should remain on Christ's victory rather than on demonic activity. The believer's position is one of victory in Christ, not constant defeat by demonic forces.",
    "relevantScriptures": [
      "Ephesians 6:10-18 - The armor of God for spiritual warfare.",
      "James 4:7 - \"Submit yourselves therefore to God. Resist the devil, and he will flee from you.\"",
      "1 Peter 5:8-9 - \"Be sober-minded; be watchful. Your adversary the devil prowls around like a roaring lion...\"",
      "Colossians 2:15 - Christ \"disarmed the rulers and authorities and put them to open shame, by triumphing over them in him.\"",
      "1 John 4:4 - \"He who is in you is greater than he who is in the world.\"",
      "2 Corinthians 10:3-5 - Spiritual weapons for destroying strongholds and taking thoughts captive."
    ]
  },
  {
    "id": "concept_4",
    "title": "Predestination and Election",
    "description": "The doctrine that God has foreordained all events, particularly the salvation of specific individuals, before the foundation of the world.",
    "biblicalNuance": "Scripture clearly teaches God's sovereign choice in salvation, using terms like \"elect,\" \"predestined,\" and \"chosen.\" At the same time, the Bible consistently affirms human responsibility, calls all people to repent and believe, and describes God as not willing that any should perish. Both divine sovereignty and human responsibility are taught without fully explaining how they reconcile.",
    "commonAbuses": [
      "Fatalism - the error that human choices don't matter since everything is predetermined.",
      "Eliminating evangelism or missions based on election (\"the elect will be saved anyway\").",
      "Using predestination to cultivate spiritual pride or exclusive claims of being \"the elect.\"",
      "Ignoring the clear biblical calls to repentance directed at all people.",
      "Teaching that God predestines people to hell (double predestination) without careful biblical support.",
      "Using election as an excuse for lack of assurance or spiritual growth.",
      "Creating division in the church over secondary aspects of election doctrine.",
      "Presenting election in a way that makes God appear arbitrary or unjust."
    ],
    "balancedPerspective": "The Bible teaches both God's sovereign election and genuine human responsibility without explaining precisely how they relate. We should affirm both truths rather than emphasizing one at the expense of the other. Predestination should lead to humility and gratitude (since salvation is by grace alone), not pride or passivity. It should motivate evangelism (as God uses means to call His elect) rather than discourage it. While Christians may differ on details of predestination, all should agree it's ultimately for God's glory and our good. Election provides comfort and assurance, not confusion or despair.",
    "relevantScriptures": [
      "Ephesians 1:4-5 - \"He chose us in him before the foundation of the world... having predestined us for adoption.\"",
      "Romans 8:29-30 - \"For those whom he foreknew he also predestined to be conformed to the image of his Son...\"",
      "John 6:44 - \"No one can come to me unless the Father who sent me draws him.\"",
      "Acts 17:30 - \"God commands all people everywhere to repent.\"",
      "2 Peter 3:9 - \"The Lord is not slow to fulfill his promise... not wishing that any should perish.\"",
      "Romans 9:14-24 - God's sovereign right to show mercy and His justice in judgment."
    ]
  },
  {
    "id": "concept_5",
    "title": "Prosperity Gospel",
    "description": "The teaching that God wants all believers to be physically healthy and materially wealthy, and that faith, positive confession, and financial giving will guarantee these blessings.",
    "biblicalNuance": "Scripture does teach that God blesses His people and sometimes includes material provision, but nowhere promises universal wealth or health to believers. The Bible shows faithful believers experiencing poverty, illness, persecution, and martyrdom. Jesus and most apostles were not wealthy, and many passages warn about the spiritual dangers of wealth and the value of contentment regardless of material circumstances.",
    "commonAbuses": [
      "Teaching that poverty or illness always indicates sin or lack of faith.",
      "Promising specific financial returns for donations (a \"seed faith\" investment).",
      "Using selective biblical texts while ignoring the Bible's warnings about wealth and teachings on suffering.",
      "Promoting a health-wealth \"gospel\" that differs fundamentally from the apostolic gospel centered on Christ's death and resurrection for sin.",
      "Exploiting the poor and desperate with false promises of prosperity.",
      "Teaching that material blessing is evidence of God's favor and spiritual maturity.",
      "Claiming that Jesus was wealthy and that Christians should expect the same.",
      "Using manipulation and guilt to extract money from followers."
    ],
    "balancedPerspective": "God does provide for His people's needs and sometimes blesses with abundance, but material prosperity is never guaranteed in this life and is not a measure of spiritual standing. The Bible calls believers to contentment in all circumstances, generosity with whatever they have, and trust in God regardless of material status. True prosperity is spiritual and relational - knowing Christ, bearing fruit, and storing up treasures in heaven rather than on earth. Christians should seek first God's kingdom rather than material gain. Suffering and hardship are often part of God's plan for spiritual growth and conformity to Christ.",
    "relevantScriptures": [
      "Philippians 4:11-13 - Paul learned contentment in both abundance and need.",
      "Matthew 19:16-30 - Jesus' teaching on the dangers of wealth and treasures in heaven.",
      "1 Timothy 6:6-10 - \"Godliness with contentment is great gain... the love of money is a root of all kinds of evils.\"",
      "Hebrews 11:35-38 - Faithful believers who suffered poverty and persecution rather than prosperity.",
      "2 Corinthians 8:9 - \"For you know the grace of our Lord Jesus Christ, that though he was rich, yet for your sake he became poor.\"",
      "James 2:5 - \"Has not God chosen those who are poor in the world to be rich in faith?\""
    ]
  },
  {
    "id": "concept_6",
    "title": "Lordship Salvation",
    "description": "The biblical teaching that genuine saving faith necessarily includes submission to Jesus Christ as Lord, not merely acceptance of Him as Savior.",
    "biblicalNuance": "Scripture consistently presents salvation as involving both faith in Christ's work and submission to His lordship. The gospel calls for repentance from sin and faith in Christ, which naturally results in a transformed life of obedience. While salvation is by grace through faith alone, genuine faith always produces works and a desire to follow Christ as Lord.",
    "commonAbuses": [
      "Adding works to faith as a requirement for salvation rather than as evidence of salvation.",
      "Creating uncertainty about salvation by demanding perfect obedience as proof of genuine faith.",
      "Confusing justification (being declared righteous) with sanctification (becoming righteous).",
      "Teaching that salvation can be lost through sin or lack of good works.",
      "Promoting legalism by focusing on external behavior rather than heart transformation.",
      "Causing believers to doubt their salvation based on ongoing struggles with sin.",
      "Making salvation dependent on the quality or quantity of one's commitment rather than Christ's finished work."
    ],
    "balancedPerspective": "Genuine saving faith necessarily includes acknowledgment of Christ's lordship, but salvation is still by grace through faith alone, not by works. The call to discipleship is inherent in the gospel call - one cannot truly receive Christ as Savior while rejecting Him as Lord. However, spiritual growth and obedience are progressive, and believers will struggle with sin throughout their earthly lives. The evidence of genuine faith is not perfection but a new direction, new desires, and perseverance in faith despite failures. Assurance comes from trusting in Christ's finished work, not in the quality of our obedience.",
    "relevantScriptures": [
      "Romans 10:9 - \"If you confess with your mouth that Jesus is Lord and believe in your heart that God raised him from the dead, you will be saved.\"",
      "Luke 14:25-33 - Jesus' teaching on counting the cost of discipleship.",
      "Matthew 7:21-23 - \"Not everyone who says to me, 'Lord, Lord,' will enter the kingdom of heaven, but the one who does the will of my Father.\"",
      "James 2:14-26 - Faith without works is dead, but works are evidence, not cause, of salvation.",
      "1 John 2:3-6 - Keeping God's commandments as evidence of knowing Him.",
      "Ephesians 2:8-10 - Saved by grace through faith, not by works, but created for good works."
    ]
  },
  {
    "id": "concept_7",
    "title": "Cessationism vs. Continuationism",
    "description": "The theological debate over whether certain spiritual gifts (particularly miraculous gifts like prophecy, tongues, and healing) ceased with the apostolic era or continue today.",
    "biblicalNuance": "Scripture records miraculous gifts in the early church and gives instructions for their use, but also indicates that some gifts had specific purposes related to establishing the church and confirming apostolic authority. The Bible emphasizes the importance of love over gifts and warns against seeking experiences over truth. Both positions acknowledge God's sovereignty in distributing gifts according to His will.",
    "commonAbuses": [
      "Claiming that lack of miraculous gifts indicates spiritual immaturity or lack of faith.",
      "Promoting counterfeit manifestations or emotionally manipulated experiences as genuine spiritual gifts.",
      "Using spiritual gifts as a test of fellowship or spiritual standing.",
      "Focusing more on gifts than on the Giver or the fruit of the Spirit.",
      "Teaching that certain gifts are necessary evidence of salvation or Spirit baptism.",
      "Creating division in the church over secondary issues related to spiritual gifts.",
      "Neglecting the clear teachings of Scripture in favor of subjective experiences.",
      "Using claims of prophetic revelation to bypass biblical authority."
    ],
    "balancedPerspective": "Whether one holds to cessationism or continuationism, all Christians should agree that Scripture is the final authority for faith and practice, that love is more important than gifts, and that any genuine spiritual manifestation will align with biblical truth and promote unity in the church. The focus should be on spiritual maturity, biblical knowledge, and Christ-like character rather than on spectacular manifestations. God is sovereign in distributing gifts, and believers should be content with whatever gifts He provides while earnestly desiring spiritual growth and usefulness in His kingdom.",
    "relevantScriptures": [
      "1 Corinthians 12-14 - Comprehensive teaching on spiritual gifts, their purpose, and proper use.",
      "1 Corinthians 13:8-13 - Love is greater than gifts; some gifts will cease.",
      "Ephesians 2:20 - The church built on the foundation of apostles and prophets.",
      "Hebrews 2:3-4 - Signs and wonders confirmed the apostolic message.",
      "1 Thessalonians 5:19-22 - Test all things; hold fast what is good.",
      "2 Timothy 3:16-17 - Scripture is sufficient for every good work."
    ]
  },
  {
    "id": "concept_8",
    "title": "Biblical Counseling vs. Psychology",
    "description": "The approach to addressing human problems and emotional struggles through biblical principles versus secular psychological methods.",
    "biblicalNuance": "Scripture presents itself as sufficient for addressing the deepest needs of the human heart and provides principles for understanding human nature, sin, suffering, and change. The Bible offers hope, wisdom, and practical guidance for life's problems. However, this doesn't necessarily exclude all insights from other fields when they align with biblical truth and are used appropriately.",
    "commonAbuses": [
      "Completely rejecting any medical or scientific understanding of mental health issues.",
      "Oversimplifying complex problems by attributing everything to sin or lack of faith.",
      "Failing to recognize legitimate medical conditions that may require professional treatment.",
      "Using biblical counseling as a substitute for necessary medical intervention.",
      "Creating guilt in those who struggle with mental health issues by implying they lack faith.",
      "Ignoring the body-soul connection and the effects of physical factors on emotional well-being.",
      "Promoting unqualified counselors who lack proper training or wisdom.",
      "Rejecting all psychological insights without careful biblical evaluation."
    ],
    "balancedPerspective": "Scripture is indeed sufficient for addressing spiritual and moral issues, and biblical principles provide the foundation for understanding human nature and change. However, this doesn't mean Christians should ignore legitimate medical knowledge or refuse appropriate treatment for physical conditions that affect mental health. The key is to filter all approaches through biblical truth, ensuring that any counseling method aligns with Scripture's view of human nature, sin, and redemption. Biblical counseling should be the primary approach for spiritual and moral issues, while medical treatment may be appropriate for genuine physiological conditions.",
    "relevantScriptures": [
      "2 Timothy 3:16-17 - Scripture is profitable for teaching, reproof, correction, and training in righteousness.",
      "Psalm 19:7-11 - The law of the Lord is perfect, reviving the soul.",
      "Hebrews 4:12 - The word of God discerns the thoughts and intentions of the heart.",
      "2 Peter 1:3 - God has granted everything pertaining to life and godliness.",
      "Galatians 6:1-2 - Restoring those caught in sin with gentleness.",
      "Romans 15:14 - Believers are able to counsel one another."
    ]
  },
  {
    "id": "concept_9",
    "title": "Church Growth Movement",
    "description": "The emphasis on numerical growth and church expansion through various methodologies, marketing techniques, and cultural adaptation.",
    "biblicalNuance": "Scripture does show the early church growing numerically and geographically, and Christians are commanded to make disciples of all nations. However, the Bible emphasizes the quality of disciples and faithfulness to God's Word over numerical success. True church growth comes through the preaching of the gospel and the work of the Holy Spirit, not through human manipulation or compromise of biblical truth.",
    "commonAbuses": [
      "Prioritizing numerical growth over spiritual maturity and biblical fidelity.",
      "Compromising biblical truth to make the gospel more appealing to unbelievers.",
      "Using worldly marketing techniques and entertainment to attract crowds.",
      "Measuring success primarily by attendance numbers rather than spiritual fruit.",
      "Adopting secular business models that conflict with biblical principles of church leadership.",
      "Focusing on felt needs rather than addressing the real need for salvation from sin.",
      "Creating consumer-oriented churches that cater to preferences rather than challenging people with truth.",
      "Neglecting church discipline and biblical standards to maintain attendance."
    ],
    "balancedPerspective": "While Christians should desire to see the church grow and reach the lost, this must be done through biblical means and with biblical priorities. True church growth comes through faithful preaching of the Word, prayer, and the work of the Holy Spirit in converting sinners and sanctifying believers. The focus should be on making disciples, not just gathering crowds. Quality is more important than quantity, and faithfulness to Scripture is more important than numerical success. Churches should seek to be both evangelistic and edifying, reaching the lost while building up believers in biblical truth.",
    "relevantScriptures": [
      "Matthew 28:19-20 - The Great Commission to make disciples, not just converts.",
      "Acts 2:41-47 - The early church's growth through preaching, fellowship, and devotion to apostolic teaching.",
      "1 Corinthians 3:6-7 - Paul plants, Apollos waters, but God gives the growth.",
      "2 Timothy 4:2-4 - Preach the word in season and out of season, even when people want their ears tickled.",
      "Ephesians 4:11-16 - The purpose of church leadership is to equip saints and build up the body.",
      "Colossians 1:28 - Presenting everyone mature in Christ."
    ]
  },
  {
    "id": "concept_10",
    "title": "Social Justice and the Gospel",
    "description": "The relationship between the gospel message and social action, including debates over whether social justice is part of the gospel or a result of the gospel.",
    "biblicalNuance": "Scripture clearly calls Christians to care for the poor, defend the oppressed, and work for justice. However, the Bible distinguishes between the gospel (the good news of salvation through Christ's death and resurrection) and the fruit of the gospel (good works that result from salvation). Social action flows from gospel transformation but is not itself the gospel.",
    "commonAbuses": [
      "Replacing the gospel of salvation with a social gospel that focuses only on temporal needs.",
      "Making social action a requirement for salvation rather than a result of salvation.",
      "Adopting worldly ideologies and methods that conflict with biblical principles.",
      "Prioritizing social issues over the proclamation of the gospel and spiritual needs.",
      "Using guilt and manipulation to promote specific political agendas in the name of Christianity.",
      "Compromising biblical truth to align with popular social movements.",
      "Creating division in the church over secondary political issues.",
      "Neglecting personal evangelism in favor of social activism."
    ],
    "balancedPerspective": "Christians should be actively involved in works of mercy and justice as a natural outflow of their faith, but this must be grounded in biblical principles and motivated by love for God and neighbor. The gospel addresses the root problem of sin and provides the power for transformation that enables genuine social change. Social action without the gospel may provide temporary relief but cannot address the heart issues that cause injustice. The church's primary mission is to preach the gospel, but this naturally results in compassionate action toward those in need.",
    "relevantScriptures": [
      "Micah 6:8 - \"He has told you, O man, what is good; and what does the LORD require of you but to do justice, and to love kindness, and to walk humbly with your God?\"",
      "James 1:27 - \"Religion that is pure and undefiled before God is this: to visit orphans and widows in their affliction.\"",
      "Galatians 2:10 - The apostles asked Paul to remember the poor, which he was eager to do.",
      "1 Corinthians 15:3-4 - The gospel is Christ's death for our sins and resurrection.",
      "Ephesians 2:8-10 - Saved by grace through faith, created for good works.",
      "Matthew 25:31-46 - Caring for the least of these as evidence of genuine faith."
    ]
  }
]