[
  {
    "id": "concept_1",
    "title": "Faith Healing",
    "description": "The belief that physical healing can come through faith in God, prayer, and in some traditions, specific healing ministers.",
    "biblicalNuance": "Scripture clearly shows God's power to heal and records many miraculous healings. Both Old and New Testaments contain accounts of divine healing through prayer and faith. However, the Bible never guarantees universal physical healing in this life for all believers, and shows faithful servants of God who remained ill (like Paul's \"thorn in the flesh\" and Timothy's stomach problems).",
    "commonAbuses": [
      "Promising guaranteed healing if someone has \"enough faith,\" creating guilt and spiritual confusion when healing doesn't occur.",
      "Discouraging or condemning the use of medical treatment as showing \"lack of faith.\"",
      "Treating healing as a formula or technique rather than God's sovereign gift.",
      "Using manipulative techniques to create the appearance of healing for financial gain or fame.",
      "Teaching that sickness is always the result of sin or lack of faith.",
      "Claiming that Christ's atonement guarantees physical healing in this life for all believers."
    ],
    "balancedPerspective": "Christians should confidently pray for healing while recognizing God's sovereignty. The Bible encourages bold prayers for healing while also showing that God sometimes allows suffering for purposes we may not understand. Faith means trusting God's goodness whether He chooses to heal physically or not. Medical treatment should be viewed as a gift from God, not opposed to faith. Ultimate healing comes in the resurrection, when believers receive glorified bodies free from all sickness and pain.",
    "relevantScriptures": [
      "James 5:14-16 - Instructions for elders to pray over the sick.",
      "2 Corinthians 12:7-10 - Paul's unanswered prayer for healing of his \"thorn in the flesh.\"",
      "1 Timothy 5:23 - Paul advises Timothy to use wine for his stomach problems rather than only seeking miraculous healing.",
      "Isaiah 53:5 - \"By his wounds we are healed\" - referring primarily to spiritual healing from sin, though with physical implications in the resurrection.",
      "Philippians 2:25-27 - Epaphroditus was sick and nearly died, showing that even faithful ministers can experience serious illness.",
      "2 Timothy 4:20 - Paul left Trophimus sick at Miletus, indicating that healing was not always immediate or guaranteed."
    ]
  },
  {
    "id": "concept_2",
    "title": "Tithing",
    "description": "The practice of giving a tenth (10%) of one's income or produce to God, often through the local church.",
    "biblicalNuance": "The Old Testament established multiple tithes for Israelites under the Mosaic covenant, supporting Levites, festivals, and the poor. The New Testament never explicitly commands tithing for Christians but establishes principles of generous, cheerful, regular, and sacrificial giving. Early Christians gave according to ability and need, sometimes far beyond a tithe.",
    "commonAbuses": [
      "Teaching that tithing is a universal requirement for Christians with the same specific regulations as in ancient Israel.",
      "Promising specific financial returns/prosperity for those who tithe (a \"spiritual investment\").",
      "Using manipulation or guilt to extract tithes rather than encouraging cheerful giving.",
      "Focusing exclusively on percentage rather than heart attitude and generosity principles.",
      "Teaching that failure to tithe results in being \"robbed by God\" or under a curse.",
      "Applying Old Testament tithing laws directly to New Testament believers without considering the change in covenant."
    ],
    "balancedPerspective": "While the specific Mosaic tithing regulations aren't binding on Christians, the principles behind tithing remain valid - God owns everything, giving should be proportional to income, and giving supports God's work. The New Testament calls for generous, sacrificial giving from the heart, not under compulsion. Tithing can be a helpful guideline or starting point for giving, but the emphasis should be on cheerful generosity according to ability, recognizing that everything we have belongs to God.",
    "relevantScriptures": [
      "2 Corinthians 9:6-7 - \"Each one must give as he has decided in his heart, not reluctantly or under compulsion, for God loves a cheerful giver.\"",
      "Acts 4:32-37 - Early Christians shared possessions according to need, with some selling property to support others.",
      "Matthew 23:23 - Jesus affirms tithing for those under the Law but emphasizes \"weightier matters.\"",
      "1 Corinthians 16:2 - Paul encourages regular, proportional giving \"as he may prosper.\"",
      "Malachi 3:8-10 - The Old Testament passage about tithing, specifically addressed to Israel under the Mosaic covenant.",
      "Luke 21:1-4 - The widow's mite, showing that the amount matters less than the heart and sacrifice involved."
    ]
  },
  {
    "id": "concept_3",
    "title": "Spiritual Warfare",
    "description": "The Christian concept of struggle against evil spiritual forces, including Satan and demons.",
    "biblicalNuance": "Scripture affirms the reality of spiritual beings (angels, demons) and describes an ongoing conflict between God's kingdom and dark spiritual forces. The Bible shows Satan as a real adversary but a defeated one, with limited power and ultimately subject to God's authority. Christians are engaged in spiritual warfare but fight primarily through truth, righteousness, faith, prayer, and the word of God (Ephesians 6).",
    "commonAbuses": [
      "Attributing every problem, illness, or difficulty to direct demonic activity without considering natural causes.",
      "Developing elaborate \"spiritual warfare techniques\" not found in scripture, often focusing on territorial spirits or generational curses.",
      "Unhealthy fixation on demons rather than focus on Christ and His victory.",
      "Claiming authority to \"bind\" Satan or demons in ways that exceed biblical teaching.",
      "Teaching that Christians can be demon-possessed rather than oppressed or influenced.",
      "Emphasizing dramatic deliverance ministries over the ordinary means of grace and spiritual growth."
    ],
    "balancedPerspective": "Christians should acknowledge the reality of spiritual warfare while avoiding both skepticism and unhealthy fascination. Scripture teaches us to resist the devil through submission to God, to put on the full armor of God, and to stand firm in faith. Spiritual warfare is real but is waged primarily through prayer, truth, righteousness, and proclamation of the gospel - not through formulaic pronouncements or dramatic rituals. Our focus should remain on Christ's victory rather than on demonic activity.",
    "relevantScriptures": [
      "Ephesians 6:10-18 - The armor of God for spiritual warfare.",
      "James 4:7 - \"Submit yourselves therefore to God. Resist the devil, and he will flee from you.\"",
      "1 Peter 5:8-9 - \"Be sober-minded; be watchful. Your adversary the devil prowls around like a roaring lion...\"",
      "Colossians 2:15 - Christ \"disarmed the rulers and authorities and put them to open shame, by triumphing over them in him.\"",
      "2 Corinthians 10:3-5 - The weapons of our warfare are not carnal but spiritual.",
      "1 John 4:4 - \"He who is in you is greater than he who is in the world.\""
    ]
  },
  {
    "id": "concept_4",
    "title": "Predestination and Election",
    "description": "The doctrine that God has foreordained all events, particularly the salvation of specific individuals, before the foundation of the world.",
    "biblicalNuance": "Scripture clearly teaches God's sovereign choice in salvation, using terms like \"elect,\" \"predestined,\" and \"chosen.\" At the same time, the Bible consistently affirms human responsibility, calls all people to repent and believe, and describes God as not willing that any should perish. Both divine sovereignty and human responsibility are taught without fully explaining how they reconcile.",
    "commonAbuses": [
      "Fatalism - the error that human choices don't matter since everything is predetermined.",
      "Eliminating evangelism or missions based on election (\"the elect will be saved anyway\").",
      "Using predestination to cultivate spiritual pride or exclusive claims of being \"the elect.\"",
      "Ignoring the clear biblical calls to repentance directed at all people.",
      "Teaching that God predestines people to hell in the same way He predestines people to salvation (double predestination).",
      "Using election as an excuse for lack of assurance or spiritual growth."
    ],
    "balancedPerspective": "The Bible teaches both God's sovereign election and genuine human responsibility without explaining precisely how they relate. We should affirm both truths rather than emphasizing one at the expense of the other. Predestination should lead to humility and gratitude (since salvation is by grace alone), not pride or passivity. It should motivate evangelism (as God uses means to call His elect) rather than discourage it. While Christians may differ on details of predestination, all should agree it's ultimately for God's glory and our good.",
    "relevantScriptures": [
      "Ephesians 1:4-5 - \"He chose us in him before the foundation of the world... having predestined us for adoption.\"",
      "Romans 8:29-30 - \"For those whom he foreknew he also predestined to be conformed to the image of his Son...\"",
      "John 6:44 - \"No one can come to me unless the Father who sent me draws him.\"",
      "Acts 17:30 - \"God commands all people everywhere to repent.\"",
      "2 Peter 3:9 - \"The Lord is not slow to fulfill his promise... not wishing that any should perish, but that all should reach repentance.\"",
      "Romans 9:14-24 - Paul's discussion of God's sovereign choice and human responsibility."
    ]
  },
  {
    "id": "concept_5",
    "title": "Prosperity Gospel",
    "description": "The teaching that God wants all believers to be physically healthy and materially wealthy, and that faith, positive confession, and financial giving will guarantee these blessings.",
    "biblicalNuance": "Scripture does teach that God blesses His people and sometimes includes material provision, but nowhere promises universal wealth or health to believers. The Bible shows faithful believers experiencing poverty, illness, persecution, and martyrdom. Jesus and most apostles were not wealthy, and many passages warn about the spiritual dangers of wealth and the value of contentment regardless of material circumstances.",
    "commonAbuses": [
      "Teaching that poverty or illness always indicates sin or lack of faith.",
      "Promising specific financial returns for donations (a \"seed faith\" investment).",
      "Using selective biblical texts while ignoring the Bible's warnings about wealth and teachings on suffering.",
      "Promoting a health-wealth \"gospel\" that differs fundamentally from the apostolic gospel centered on Christ's death and resurrection for sin.",
      "Teaching that Christians should expect to live like kings and queens in this life.",
      "Manipulating people's financial desperation to extract donations with promises of divine blessing."
    ],
    "balancedPerspective": "God does provide for His people's needs and sometimes blesses with abundance, but material prosperity is never guaranteed in this life and is not a measure of spiritual standing. The Bible calls believers to contentment in all circumstances, generosity with whatever they have, and trust in God regardless of material status. True prosperity is spiritual and relational - knowing Christ, bearing fruit, and storing up treasures in heaven rather than on earth. Christians should seek first God's kingdom rather than material gain.",
    "relevantScriptures": [
      "Philippians 4:11-13 - Paul learned contentment in both abundance and need.",
      "Matthew 19:16-30 - Jesus' teaching on the dangers of wealth and treasures in heaven.",
      "1 Timothy 6:6-10 - \"Godliness with contentment is great gain... the love of money is a root of all kinds of evils.\"",
      "Hebrews 11:35-38 - Faithful believers who suffered poverty and persecution rather than prosperity.",
      "Luke 6:20-26 - The Beatitudes, including \"Blessed are you who are poor\" and \"Woe to you who are rich.\"",
      "2 Corinthians 8:9 - \"For you know the grace of our Lord Jesus Christ, that though he was rich, yet for your sake he became poor.\""
    ]
  },
  {
    "id": "concept_6",
    "title": "Baptism",
    "description": "The Christian ordinance of water baptism as a symbol of death to sin and resurrection to new life in Christ.",
    "biblicalNuance": "The New Testament presents baptism as the normal response to faith in Christ, symbolizing the believer's union with Christ in His death and resurrection. While the mode (immersion, sprinkling, pouring) and timing (infant vs. believer's baptism) are debated among Christians, the essential meaning is clear: baptism is an outward sign of an inward spiritual reality.",
    "commonAbuses": [
      "Teaching that baptism is necessary for salvation (baptismal regeneration).",
      "Insisting that only one mode of baptism (immersion, sprinkling, etc.) is valid.",
      "Making baptism a requirement for church membership without regard for genuine faith.",
      "Treating baptism as a magical ritual that automatically confers spiritual benefits.",
      "Rebaptizing believers unnecessarily based on denominational preferences.",
      "Using baptism as a means of spiritual manipulation or control."
    ],
    "balancedPerspective": "Baptism is an important ordinance commanded by Christ and practiced by the early church. It serves as a public declaration of faith and a symbol of the believer's identification with Christ's death and resurrection. While Christians may differ on the mode and timing of baptism, all should agree that it is an act of obedience that follows genuine faith and conversion. Baptism does not save, but it is a normal and expected response to salvation.",
    "relevantScriptures": [
      "Matthew 28:19 - The Great Commission includes baptizing disciples.",
      "Romans 6:3-4 - Baptism symbolizes death to sin and resurrection to new life.",
      "Acts 2:38 - Peter's call to repent and be baptized.",
      "Acts 8:36-37 - The Ethiopian eunuch's baptism following his profession of faith.",
      "1 Peter 3:21 - Baptism as an appeal to God for a good conscience.",
      "Galatians 3:27 - \"For as many of you as were baptized into Christ have put on Christ.\""
    ]
  },
  {
    "id": "concept_7",
    "title": "Speaking in Tongues",
    "description": "The spiritual gift of speaking in languages not learned by the speaker, either known human languages or a heavenly prayer language.",
    "biblicalNuance": "The New Testament records speaking in tongues as a spiritual gift given by the Holy Spirit, both as known human languages (Acts 2) and as a prayer language (1 Corinthians 14). However, Paul regulates this gift carefully, emphasizing that not all believers speak in tongues and that love is more important than any spiritual gift.",
    "commonAbuses": [
      "Teaching that speaking in tongues is the necessary evidence of baptism in the Holy Spirit.",
      "Pressuring believers to speak in tongues or making them feel spiritually inferior if they don't.",
      "Allowing uninterpreted tongues in public worship, contrary to Paul's instructions.",
      "Treating tongues as the most important or desirable spiritual gift.",
      "Manufacturing or faking tongues-speaking through emotional manipulation.",
      "Using tongues as a mark of spiritual superiority or elite status."
    ],
    "balancedPerspective": "Speaking in tongues is a legitimate spiritual gift mentioned in the New Testament, but it is not given to all believers nor is it the sign of spiritual maturity. Paul's instructions in 1 Corinthians 14 emphasize order, interpretation, and edification in the use of this gift. Whether one believes tongues continue today or ceased with the apostolic age, all Christians should agree that love, not gifts, is the mark of spiritual maturity, and that the fruit of the Spirit is more important than the gifts of the Spirit.",
    "relevantScriptures": [
      "1 Corinthians 12:4-11 - The diversity of spiritual gifts, including tongues.",
      "1 Corinthians 12:30 - \"Do all speak with tongues?\" (expecting a negative answer).",
      "1 Corinthians 14:1-25 - Paul's regulation of tongues in public worship.",
      "1 Corinthians 13:1 - \"If I speak in the tongues of men and of angels, but have not love, I am a noisy gong.\"",
      "Acts 2:4-11 - The disciples speaking in known human languages at Pentecost.",
      "1 Corinthians 14:39 - \"Do not forbid speaking in tongues.\""
    ]
  },
  {
    "id": "concept_8",
    "title": "Church Discipline",
    "description": "The biblical practice of correcting sin within the church community through various levels of confrontation and, if necessary, removal from fellowship.",
    "biblicalNuance": "Jesus and the apostles taught that the church has a responsibility to address sin among its members through a process of loving correction. This discipline is intended for restoration, not punishment, and should be carried out with gentleness and humility. The ultimate goal is repentance and reconciliation.",
    "commonAbuses": [
      "Using church discipline as a tool for control or manipulation rather than restoration.",
      "Applying discipline inconsistently, often targeting the powerless while protecting the influential.",
      "Skipping the biblical steps of private confrontation before public discipline.",
      "Disciplining for matters of preference or tradition rather than clear biblical commands.",
      "Conducting discipline in a harsh, unloving manner that destroys rather than restores.",
      "Refusing to restore repentant members or holding grudges after repentance."
    ],
    "balancedPerspective": "Church discipline is a biblical responsibility that should be exercised with great care, love, and humility. The goal is always restoration and the health of the church body. Discipline should follow the biblical pattern of private confrontation first, then involving witnesses, and finally the church body. It should be applied consistently and fairly, with the hope of repentance and restoration. Churches that neglect discipline enable sin, while churches that abuse discipline become legalistic and harsh.",
    "relevantScriptures": [
      "Matthew 18:15-17 - Jesus' instructions for confronting sin in the church.",
      "1 Corinthians 5:1-13 - Paul's instructions for disciplining the immoral brother.",
      "2 Corinthians 2:6-8 - The call to restore the repentant member.",
      "Galatians 6:1 - \"If anyone is caught in any transgression, you who are spiritual should restore him in a spirit of gentleness.\"",
      "1 Timothy 5:20 - \"As for those who persist in sin, rebuke them in the presence of all.\"",
      "2 Thessalonians 3:14-15 - Discipline should be done with love, not as treating someone as an enemy."
    ]
  },
  {
    "id": "concept_9",
    "title": "Women in Ministry",
    "description": "The biblical teaching regarding the roles and limitations of women in church leadership and ministry.",
    "biblicalNuance": "Scripture shows women actively participating in ministry throughout both Testaments, including as prophets, teachers, and church workers. However, the New Testament also contains specific instructions about women's roles in church leadership, particularly regarding teaching and authority over men in the church context. These passages must be understood in their historical and cultural context while maintaining their normative authority.",
    "commonAbuses": [
      "Using biblical texts to suppress women's gifts and calling in all areas of ministry and service.",
      "Ignoring the many examples of women in ministry roles throughout Scripture.",
      "Applying church-specific restrictions to all areas of life and society.",
      "Using cultural arguments to dismiss clear biblical teachings about gender roles.",
      "Creating artificial barriers that go beyond what Scripture actually teaches.",
      "Treating women as second-class citizens in the kingdom of God."
    ],
    "balancedPerspective": "Scripture affirms the equal value and dignity of men and women as image-bearers of God while also teaching complementary roles, particularly in marriage and church leadership. Women are gifted by God for ministry and should be encouraged to use their gifts in appropriate ways. The specific restrictions in 1 Timothy 2 and 1 Corinthians 14 relate to teaching and authority in the church context, not to women's participation in ministry generally. Churches should carefully study these passages and apply them faithfully while encouraging all members to use their gifts for God's glory.",
    "relevantScriptures": [
      "1 Timothy 2:11-12 - Paul's instruction about women teaching and having authority over men.",
      "1 Corinthians 14:34-35 - Instructions about women speaking in church.",
      "Galatians 3:28 - \"There is neither male nor female, for you are all one in Christ Jesus.\"",
      "Acts 18:26 - Priscilla and Aquila explaining the way of God to Apollos.",
      "Romans 16:1-16 - Paul's commendation of many women in ministry.",
      "Titus 2:3-5 - Older women teaching younger women."
    ]
  },
  {
    "id": "concept_10",
    "title": "Biblical Counseling",
    "description": "The practice of using Scripture as the primary resource for addressing personal problems, emotional struggles, and life issues.",
    "biblicalNuance": "Scripture presents itself as sufficient for addressing the spiritual and moral dimensions of human problems. The Bible contains principles for living, comfort for suffering, and guidance for decision-making. However, it also recognizes the complexity of human nature and the value of wise counsel from multiple sources.",
    "commonAbuses": [
      "Claiming that all emotional or psychological problems are simply sin issues that only require biblical solutions.",
      "Dismissing the value of medical treatment for mental health conditions.",
      "Using Scripture as a weapon to shame or condemn rather than to heal and restore.",
      "Oversimplifying complex problems with simplistic biblical formulas.",
      "Ignoring the role of physical factors (brain chemistry, hormones, etc.) in emotional struggles.",
      "Discouraging professional help when it might be beneficial or necessary."
    ],
    "balancedPerspective": "Scripture is indeed sufficient for addressing the spiritual dimensions of human problems and provides essential wisdom for living. Biblical counseling can be very helpful for many issues. However, this doesn't mean that all problems are purely spiritual or that other forms of help (medical, psychological) are unnecessary. God has given wisdom and knowledge in many fields, and Christians should be grateful for all legitimate means of help while maintaining the primacy of Scripture for spiritual and moral issues.",
    "relevantScriptures": [
      "2 Timothy 3:16-17 - Scripture's sufficiency for equipping believers for every good work.",
      "Psalm 19:7-11 - The law of the Lord as perfect, reviving the soul.",
      "Proverbs 27:5-6 - The value of faithful wounds from a friend.",
      "Galatians 6:1-2 - Restoring those caught in transgression and bearing one another's burdens.",
      "Romans 15:14 - Believers being able to instruct one another.",
      "Proverbs 11:14 - \"In an abundance of counselors there is safety.\""
    ]
  }
]