[
  {
    "id": "concept_1",
    "title": "Faith Healing",
    "description": "The belief that physical healing can come through faith in God, prayer, and in some traditions, specific healing ministers.",
    "biblicalNuance": "Scripture clearly shows God's power to heal and records many miraculous healings. Both Old and New Testaments contain accounts of divine healing through prayer and faith. However, the Bible never guarantees universal physical healing in this life for all believers, and shows faithful servants of God who remained ill (like Paul's \"thorn in the flesh\" and Timothy's stomach problems).",
    "commonAbuses": [
      "Promising guaranteed healing if someone has \"enough faith,\" creating guilt and spiritual confusion when healing doesn't occur.",
      "Discouraging or condemning the use of medical treatment as showing \"lack of faith.\"",
      "Treating healing as a formula or technique rather than God's sovereign gift.",
      "Using manipulative techniques to create the appearance of healing for financial gain or fame."
    ],
    "balancedPerspective": "Christians should confidently pray for healing while recognizing God's sovereignty. The Bible encourages bold prayers for healing while also showing that God sometimes allows suffering for purposes we may not understand. Faith means trusting God's goodness whether He chooses to heal physically or not. Medical treatment should be viewed as a gift from God, not opposed to faith. Ultimate healing comes in the resurrection, when believers receive glorified bodies free from all sickness and pain.",
    "relevantScriptures": [
      "James 5:14-16 - Instructions for elders to pray over the sick.",
      "2 Corinthians 12:7-10 - Paul's unanswered prayer for healing of his \"thorn in the flesh.\"",
      "1 Timothy 5:23 - Paul advises Timothy to use wine for his stomach problems rather than only seeking miraculous healing.",
      "Isaiah 53:5 - \"By his wounds we are healed\" - referring primarily to spiritual healing from sin, though with physical implications in the resurrection."
    ]
  },
  {
    "id": "concept_2",
    "title": "Tithing",
    "description": "The practice of giving a tenth (10%) of one's income or produce to God, often through the local church.",
    "biblicalNuance": "The Old Testament established multiple tithes for Israelites under the Mosaic covenant, supporting Levites, festivals, and the poor. The New Testament never explicitly commands tithing for Christians but establishes principles of generous, cheerful, regular, and sacrificial giving. Early Christians gave according to ability and need, sometimes far beyond a tithe.",
    "commonAbuses": [
      "Teaching that tithing is a universal requirement for Christians with the same specific regulations as in ancient Israel.",
      "Promising specific financial returns/prosperity for those who tithe (a \"spiritual investment\").",
      "Using manipulation or guilt to extract tithes rather than encouraging cheerful giving.",
      "Focusing exclusively on percentage rather than heart attitude and generosity principles."
    ],
    "balancedPerspective": "While the specific Mosaic tithing regulations aren't binding on Christians, the principles behind tithing remain valid - God owns everything, giving should be proportional to income, and giving supports God's work. The New Testament calls for generous, sacrificial giving from the heart, not under compulsion. Tithing can be a helpful guideline or starting point for giving, but the emphasis should be on cheerful generosity according to ability, recognizing that everything we have belongs to God.",
    "relevantScriptures": [
      "2 Corinthians 9:6-7 - \"Each one must give as he has decided in his heart, not reluctantly or under compulsion, for God loves a cheerful giver.\"",
      "Acts 4:32-37 - Early Christians shared possessions according to need, with some selling property to support others.",
      "Matthew 23:23 - Jesus affirms tithing for those under the Law but emphasizes \"weightier matters.\"",
      "1 Corinthians 16:2 - Paul encourages regular, proportional giving \"as he may prosper.\""
    ]
  },
  {
    "id": "concept_3",
    "title": "Spiritual Warfare",
    "description": "The Christian concept of struggle against evil spiritual forces, including Satan and demons.",
    "biblicalNuance": "Scripture affirms the reality of spiritual beings (angels, demons) and describes an ongoing conflict between God's kingdom and dark spiritual forces. The Bible shows Satan as a real adversary but a defeated one, with limited power and ultimately subject to God's authority. Christians are engaged in spiritual warfare but fight primarily through truth, righteousness, faith, prayer, and the word of God (Ephesians 6).",
    "commonAbuses": [
      "Attributing every problem, illness, or difficulty to direct demonic activity without considering natural causes.",
      "Developing elaborate \"spiritual warfare techniques\" not found in scripture, often focusing on territorial spirits or generational curses.",
      "Unhealthy fixation on demons rather than focus on Christ and His victory.",
      "Claiming authority to \"bind\" Satan or demons in ways that exceed biblical teaching."
    ],
    "balancedPerspective": "Christians should acknowledge the reality of spiritual warfare while avoiding both skepticism and unhealthy fascination. Scripture teaches us to resist the devil through submission to God, to put on the full armor of God, and to stand firm in faith. Spiritual warfare is real but is waged primarily through prayer, truth, righteousness, and proclamation of the gospel - not through formulaic pronouncements or dramatic rituals. Our focus should remain on Christ's victory rather than on demonic activity.",
    "relevantScriptures": [
      "Ephesians 6:10-18 - The armor of God for spiritual warfare.",
      "James 4:7 - \"Submit yourselves therefore to God. Resist the devil, and he will flee from you.\"",
      "1 Peter 5:8-9 - \"Be sober-minded; be watchful. Your adversary the devil prowls around like a roaring lion...\"",
      "Colossians 2:15 - Christ \"disarmed the rulers and authorities and put them to open shame, by triumphing over them in him.\""
    ]
  },
  {
    "id": "concept_4",
    "title": "Predestination",
    "description": "The doctrine that God has foreordained all events, particularly the salvation of specific individuals, before the foundation of the world.",
    "biblicalNuance": "Scripture clearly teaches God's sovereign choice in salvation, using terms like \"elect,\" \"predestined,\" and \"chosen.\" At the same time, the Bible consistently affirms human responsibility, calls all people to repent and believe, and describes God as not willing that any should perish. Both divine sovereignty and human responsibility are taught without fully explaining how they reconcile.",
    "commonAbuses": [
      "Fatalism - the error that human choices don't matter since everything is predetermined.",
      "Eliminating evangelism or missions based on election (\"the elect will be saved anyway\").",
      "Using predestination to cultivate spiritual pride or exclusive claims of being \"the elect.\"",
      "Ignoring the clear biblical calls to repentance directed at all people."
    ],
    "balancedPerspective": "The Bible teaches both God's sovereign election and genuine human responsibility without explaining precisely how they relate. We should affirm both truths rather than emphasizing one at the expense of the other. Predestination should lead to humility and gratitude (since salvation is by grace alone), not pride or passivity. It should motivate evangelism (as God uses means to call His elect) rather than discourage it. While Christians may differ on details of predestination, all should agree it's ultimately for God's glory and our good.",
    "relevantScriptures": [
      "Ephesians 1:4-5 - \"He chose us in him before the foundation of the world... having predestined us for adoption.\"",
      "Romans 8:29-30 - \"For those whom he foreknew he also predestined to be conformed to the image of his Son...\"",
      "John 6:44 - \"No one can come to me unless the Father who sent me draws him.\"",
      "Acts 17:30 - \"God commands all people everywhere to repent.\""
    ]
  },
  {
    "id": "concept_5",
    "title": "Prosperity Gospel",
    "description": "The teaching that God wants all believers to be physically healthy and materially wealthy, and that faith, positive confession, and financial giving will guarantee these blessings.",
    "biblicalNuance": "Scripture does teach that God blesses His people and sometimes includes material provision, but nowhere promises universal wealth or health to believers. The Bible shows faithful believers experiencing poverty, illness, persecution, and martyrdom. Jesus and most apostles were not wealthy, and many passages warn about the spiritual dangers of wealth and the value of contentment regardless of material circumstances.",
    "commonAbuses": [
      "Teaching that poverty or illness always indicates sin or lack of faith.",
      "Promising specific financial returns for donations (a \"seed faith\" investment).",
      "Using selective biblical texts while ignoring the Bible's warnings about wealth and teachings on suffering.",
      "Promoting a health-wealth \"gospel\" that differs fundamentally from the apostolic gospel centered on Christ's death and resurrection for sin."
    ],
    "balancedPerspective": "God does provide for His people's needs and sometimes blesses with abundance, but material prosperity is never guaranteed in this life and is not a measure of spiritual standing. The Bible calls believers to contentment in all circumstances, generosity with whatever they have, and trust in God regardless of material status. True prosperity is spiritual and relational - knowing Christ, bearing fruit, and storing up treasures in heaven rather than on earth. Christians should seek first God's kingdom rather than material gain.",
    "relevantScriptures": [
      "Philippians 4:11-13 - Paul learned contentment in both abundance and need.",
      "Matthew 19:16-30 - Jesus' teaching on the dangers of wealth and treasures in heaven.",
      "1 Timothy 6:6-10 - \"Godliness with contentment is great gain... the love of money is a root of all kinds of evils.\"",
      "Hebrews 11:35-38 - Faithful believers who suffered poverty and persecution rather than prosperity."
    ]
  }
]