[
  {
    "id": "doctrine_1",
    "title": "The Trinity",
    "summary": "The doctrine that God is one Being who exists eternally in three persons: Father, Son, and Holy Spirit.",
    "biblicalDefinition": "God eternally exists as three persons—Father, Son, and Holy Spirit—who are unified in one Being or essence. Each person is fully God, equal in power, glory, and attributes, yet they are not three gods but one God. The Trinity is a mystery beyond full human comprehension, yet clearly revealed in Scripture.",
    "keyScriptures": [
      "Matthew 28:19 - \"Go therefore and make disciples of all nations, baptizing them in the name of the Father and of the Son and of the Holy Spirit.\"",
      "John 1:1-18 - Establishes the deity of Christ (the Word) and His distinction from the Father.",
      "2 Corinthians 13:14 - \"The grace of the Lord Jesus Christ and the love of God and the fellowship of the Holy Spirit be with you all.\"",
      "Genesis 1:26 - \"Then God said, 'Let us make man in our image, after our likeness.'\"",
      "Matthew 3:16-17 - At Jesus' baptism, all three persons of the Trinity are present and distinct."
    ],
    "commonMisunderstandings": [
      "Modalism - The false teaching that God is one person who appears in different \"modes\" at different times (Father, then Son, then Spirit) rather than three eternal persons.",
      "Arianism - The heresy claiming Jesus was created by God and not eternal or fully divine.",
      "Tritheism - The error of treating the three persons as three separate gods rather than one being.",
      "Subordinationism - The incorrect view that the Son and Spirit are eternally subordinate in nature or essence to the Father, rather than equal in divinity."
    ],
    "category": "Theology Proper"
  },
  {
    "id": "doctrine_2",
    "title": "Justification by Faith Alone",
    "summary": "The doctrine that sinners are declared righteous before God solely through faith in Jesus Christ, apart from works.",
    "biblicalDefinition": "Justification is God's legal declaration that a sinner is righteous in His sight, based not on the sinner's own merit but entirely on Christ's perfect righteousness imputed to them through faith. It is a one-time act of God's free grace wherein He pardons sin and accepts us as righteous solely because of Christ's work on our behalf.",
    "keyScriptures": [
      "Romans 3:23-24 - \"For all have sinned and fall short of the glory of God, and are justified by his grace as a gift, through the redemption that is in Christ Jesus.\"",
      "Galatians 2:16 - \"Yet we know that a person is not justified by works of the law but through faith in Jesus Christ.\"",
      "Romans 5:1 - \"Therefore, since we have been justified by faith, we have peace with God through our Lord Jesus Christ.\"",
      "Ephesians 2:8-9 - \"For by grace you have been saved through faith. And this is not your own doing; it is the gift of God, not a result of works, so that no one may boast.\"",
      "Philippians 3:9 - \"...not having a righteousness of my own that comes from the law, but that which comes through faith in Christ, the righteousness from God that depends on faith.\""
    ],
    "commonMisunderstandings": [
      "That justification can be earned through good works or religious observance.",
      "That justification is simply God overlooking our sins rather than declaring us righteous based on Christ's imputed righteousness.",
      "That justification is the same as sanctification (the ongoing process of becoming holy).",
      "That justification means we will never sin again or that the Christian life doesn't require ongoing repentance."
    ],
    "category": "Soteriology"
  },
  {
    "id": "doctrine_3",
    "title": "The Authority and Inerrancy of Scripture",
    "summary": "The doctrine that the Bible is God's infallible and authoritative revelation, without error in the original manuscripts, and the final standard for faith and practice.",
    "biblicalDefinition": "Scripture is God-breathed (inspired), without error in the original manuscripts (infallible and inerrant), and the final authority for all matters of faith and practice. The Bible is not merely a human book but God's very words communicated through human authors, making it entirely trustworthy and authoritative for all believers.",
    "keyScriptures": [
      "2 Timothy 3:16-17 - \"All Scripture is breathed out by God and profitable for teaching, for reproof, for correction, and for training in righteousness, that the man of God may be complete, equipped for every good work.\"",
      "2 Peter 1:20-21 - \"No prophecy of Scripture comes from someone's own interpretation. For no prophecy was ever produced by the will of man, but men spoke from God as they were carried along by the Holy Spirit.\"",
      "Psalm 19:7 - \"The law of the LORD is perfect, reviving the soul; the testimony of the LORD is sure, making wise the simple.\"",
      "Matthew 5:18 - \"For truly, I say to you, until heaven and earth pass away, not an iota, not a dot, will pass from the Law until all is accomplished.\"",
      "Isaiah 40:8 - \"The grass withers, the flower fades, but the word of our God will stand forever.\""
    ],
    "commonMisunderstandings": [
      "That the Bible contains God's Word but is not entirely God's Word (partial inspiration).",
      "That the Bible is only inspired in matters of faith and not in historical, scientific, or other claims.",
      "That the church or individual spiritual experiences have equal or greater authority than Scripture.",
      "That the Bible can be perfectly understood apart from the illumination of the Holy Spirit or without considering historical and literary context."
    ],
    "category": "Bibliology"
  },
  {
    "id": "doctrine_4",
    "title": "The Incarnation",
    "summary": "The doctrine that the eternal Son of God took on human nature and became man in the person of Jesus Christ.",
    "biblicalDefinition": "In the incarnation, the eternal Son of God, the second person of the Trinity, without ceasing to be fully God, took upon Himself a complete human nature (body, soul, and spirit) and became truly man in the person of Jesus Christ. Jesus is therefore fully God and fully man in one person, uniting two natures without confusion, change, division, or separation.",
    "keyScriptures": [
      "John 1:14 - \"And the Word became flesh and dwelt among us, and we have seen his glory, glory as of the only Son from the Father, full of grace and truth.\"",
      "Philippians 2:5-8 - \"Christ Jesus, who, though he was in the form of God...emptied himself, by taking the form of a servant, being born in the likeness of men.\"",
      "Colossians 2:9 - \"For in him the whole fullness of deity dwells bodily.\"",
      "Hebrews 2:14-17 - Explains how Jesus \"partook of\" our humanity to save us.",
      "1 John 4:2-3 - \"Every spirit that confesses that Jesus Christ has come in the flesh is from God.\""
    ],
    "commonMisunderstandings": [
      "Docetism - The heresy claiming Jesus only appeared to be human but wasn't truly flesh and blood.",
      "Nestorianism - The error of treating Christ as two separate persons (divine and human) rather than one person with two natures.",
      "Monophysitism - The heresy claiming Christ had only one nature that was a mixture of divine and human.",
      "Adoptionism - The false teaching that Jesus was merely human and was \"adopted\" as God's Son at His baptism or resurrection."
    ],
    "category": "Christology"
  },
  {
    "id": "doctrine_5",
    "title": "Sanctification",
    "summary": "The progressive work of God and man that makes us more and more free from sin and like Christ in our actual lives.",
    "biblicalDefinition": "Sanctification is the ongoing work of God in the life of the believer, making the Christian increasingly free from sin and increasingly like Christ in actual character and actions. Unlike justification (which happens once), sanctification is a progressive lifelong process in which the Holy Spirit works in believers as they actively participate through spiritual disciplines, obedience, and putting sin to death.",
    "keyScriptures": [
      "1 Thessalonians 4:3 - \"For this is the will of God, your sanctification.\"",
      "Romans 8:13 - \"For if you live according to the flesh you will die, but if by the Spirit you put to death the deeds of the body, you will live.\"",
      "2 Corinthians 3:18 - \"And we all, with unveiled face, beholding the glory of the Lord, are being transformed into the same image from one degree of glory to another.\"",
      "Philippians 2:12-13 - \"Work out your own salvation with fear and trembling, for it is God who works in you, both to will and to work for his good pleasure.\"",
      "Romans 6:22 - \"But now that you have been set free from sin and have become slaves of God, the fruit you get leads to sanctification and its end, eternal life.\""
    ],
    "commonMisunderstandings": [
      "Perfectionism - The false teaching that Christians can achieve sinless perfection in this life.",
      "Antinomianism - The error claiming Christians are free from moral law and don't need to strive for holiness.",
      "Legalism - The error of reducing sanctification to external rule-following rather than heart transformation.",
      "Passivism - The misconception that sanctification is entirely God's work with no human responsibility (\"let go and let God\")."
    ],
    "category": "Soteriology"
  },
  {
    "id": "doctrine_6",
    "title": "The Sovereignty of God",
    "summary": "The doctrine that God is supreme ruler over all creation, exercising absolute authority and control over all things according to His perfect will.",
    "biblicalDefinition": "God's sovereignty means He is the supreme authority over all creation, possessing absolute power and control over every aspect of existence. Nothing happens outside His will or beyond His control. He ordains all things according to His eternal purpose and works all things together for His glory and the good of His people.",
    "keyScriptures": [
      "Ephesians 1:11 - \"In him we have obtained an inheritance, having been predestined according to the purpose of him who works all things according to the counsel of his will.\"",
      "Daniel 4:35 - \"All the inhabitants of the earth are accounted as nothing, and he does according to his will among the host of heaven and among the inhabitants of the earth; and none can stay his hand or say to him, 'What have you done?'\"",
      "Psalm 115:3 - \"Our God is in the heavens; he does all that he pleases.\"",
      "Isaiah 46:9-10 - \"I am God, and there is no other; I am God, and there is none like me, declaring the end from the beginning and from ancient times things not yet done, saying, 'My counsel shall stand, and I will accomplish all my purpose.'\"",
      "Romans 9:20-21 - \"But who are you, O man, to answer back to God? Will what is molded say to its molder, 'Why have you made me like this?' Has the potter no right over the clay?\""
    ],
    "commonMisunderstandings": [
      "That God's sovereignty eliminates human responsibility or makes humans mere robots.",
      "That sovereignty means God is the author of sin or evil.",
      "That divine sovereignty and human free will are mutually exclusive concepts.",
      "That God's sovereignty makes prayer, evangelism, or human effort meaningless."
    ],
    "category": "Theology Proper"
  },
  {
    "id": "doctrine_7",
    "title": "The Perseverance of the Saints",
    "summary": "The doctrine that those who are truly saved will persevere in faith and good works until the end, being kept by God's power.",
    "biblicalDefinition": "True believers, having been regenerated by the Holy Spirit and justified by faith, will persevere in faith and holiness until death. This perseverance is not based on human strength but on God's preserving grace. Those who fall away permanently were never truly saved to begin with.",
    "keyScriptures": [
      "John 10:28-29 - \"I give them eternal life, and they will never perish, and no one will snatch them out of my hand. My Father, who has given them to me, is greater than all, and no one is able to snatch them out of the Father's hand.\"",
      "Philippians 1:6 - \"And I am sure of this, that he who began a good work in you will bring it to completion at the day of Jesus Christ.\"",
      "1 Peter 1:5 - \"who by God's power are being guarded through faith for a salvation ready to be revealed in the last time.\"",
      "Romans 8:38-39 - \"For I am sure that neither death nor life...will be able to separate us from the love of God in Christ Jesus our Lord.\"",
      "1 John 2:19 - \"They went out from us, but they were not of us; for if they had been of us, they would have continued with us.\""
    ],
    "commonMisunderstandings": [
      "That perseverance means Christians will never sin or struggle with doubt.",
      "That this doctrine promotes carelessness about sin or spiritual disciplines.",
      "That temporary backsliding proves someone was never saved.",
      "That human effort plays no role in perseverance (antinomianism)."
    ],
    "category": "Soteriology"
  },
  {
    "id": "doctrine_8",
    "title": "The Substitutionary Atonement",
    "summary": "The doctrine that Christ died as a substitute for sinners, bearing the penalty of sin in their place to satisfy God's justice.",
    "biblicalDefinition": "Jesus Christ, as the sinless Son of God, died on the cross as a substitute for sinners, bearing the full penalty and wrath of God that their sins deserved. His death satisfied God's justice and made possible the forgiveness of sins for all who believe. This substitution is the heart of the gospel.",
    "keyScriptures": [
      "Isaiah 53:5-6 - \"But he was pierced for our transgressions; he was crushed for our iniquities; upon him was the chastisement that brought us peace, and with his wounds we are healed. All we like sheep have gone astray; we have turned—every one—to his own way; and the LORD has laid on him the iniquity of us all.\"",
      "2 Corinthians 5:21 - \"For our sake he made him to be sin who knew no sin, so that in him we might become the righteousness of God.\"",
      "1 Peter 3:18 - \"For Christ also suffered once for sins, the righteous for the unrighteous, that he might bring us to God.\"",
      "Galatians 3:13 - \"Christ redeemed us from the curse of the law by becoming a curse for us.\"",
      "Romans 3:25 - \"whom God put forward as a propitiation by his blood, to be received by faith.\""
    ],
    "commonMisunderstandings": [
      "That Christ's death was merely an example of love rather than a payment for sin.",
      "That the atonement makes salvation possible but doesn't actually save anyone.",
      "That Christ died for everyone in exactly the same way (unlimited atonement).",
      "That the cross was God the Father abusing an innocent victim (misunderstanding of penal substitution)."
    ],
    "category": "Soteriology"
  },
  {
    "id": "doctrine_9",
    "title": "The Total Depravity of Man",
    "summary": "The doctrine that sin has affected every part of human nature, rendering all people unable to save themselves or truly seek God.",
    "biblicalDefinition": "As a result of the Fall, every aspect of human nature (mind, will, emotions, body) has been corrupted by sin. This doesn't mean people are as evil as they could be, but that sin affects every part of their being, making them spiritually dead and unable to respond to God apart from His grace.",
    "keyScriptures": [
      "Romans 3:10-12 - \"None is righteous, no, not one; no one understands; no one seeks for God. All have turned aside; together they have become worthless; no one does good, not even one.\"",
      "Ephesians 2:1-3 - \"And you were dead in the trespasses and sins in which you once walked...and were by nature children of wrath, like the rest of mankind.\"",
      "Jeremiah 17:9 - \"The heart is deceitful above all things, and desperately sick; who can understand it?\"",
      "1 Corinthians 2:14 - \"The natural person does not accept the things of the Spirit of God, for they are folly to him, and he is not able to understand them because they are spiritually discerned.\"",
      "John 6:44 - \"No one can come to me unless the Father who sent me draws him.\""
    ],
    "commonMisunderstandings": [
      "That total depravity means humans are as evil as they possibly could be.",
      "That people cannot do any good works or show kindness to others.",
      "That this doctrine eliminates human responsibility for sin.",
      "That total depravity is incompatible with the image of God in man."
    ],
    "category": "Anthropology"
  },
  {
    "id": "doctrine_10",
    "title": "The Second Coming of Christ",
    "summary": "The doctrine that Jesus Christ will return bodily and visibly to earth to judge the living and the dead and establish His eternal kingdom.",
    "biblicalDefinition": "Jesus Christ, who ascended into heaven after His resurrection, will return to earth in the same bodily form. His return will be visible, glorious, and sudden. He will judge all humanity, resurrect the dead, and establish His eternal kingdom. This return is the blessed hope of all believers.",
    "keyScriptures": [
      "Acts 1:11 - \"This Jesus, who was taken up from you into heaven, will come in the same way as you saw him go into heaven.\"",
      "Matthew 24:30 - \"Then will appear in heaven the sign of the Son of Man, and then all the tribes of the earth will mourn, and they will see the Son of Man coming on the clouds of heaven with power and great glory.\"",
      "1 Thessalonians 4:16-17 - \"For the Lord himself will descend from heaven with a cry of command, with the voice of an archangel, and with the sound of the trumpet of God. And the dead in Christ will rise first. Then we who are alive, who are left, will be caught up together with them in the clouds to meet the Lord in the air.\"",
      "Revelation 19:11-16 - Describes Christ's return as King of kings and Lord of lords.",
      "Titus 2:13 - \"waiting for our blessed hope, the appearing of the glory of our great God and Savior Jesus Christ.\""
    ],
    "commonMisunderstandings": [
      "That Christ's return is merely spiritual or symbolic rather than literal and bodily.",
      "That the timing of His return can be calculated or predicted with certainty.",
      "That the Second Coming is the same event as the destruction of Jerusalem in AD 70 (preterism).",
      "That believers will not face tribulation before Christ's return (prosperity theology)."
    ],
    "category": "Eschatology"
  }
]