[
  {
    "id": "myth_1",
    "title": "God wants me to be happy above all else",
    "popularPerception": "God's primary concern is my personal happiness and fulfillment. If something makes me happy, it must be God's will for my life.",
    "biblicalCounterArgument": {
      "scripturalRefutation": "Scripture never promises happiness as God's primary goal for believers. Instead, it emphasizes holiness, obedience, and Christlikeness.",
      "contextualExplanation": "The modern focus on personal happiness as the ultimate goal is a cultural value, not a biblical one. Scripture consistently shows that God often calls people to difficult paths that don't immediately yield happiness.",
      "soundDoctrine": "God is more concerned with our holiness than our happiness. His ultimate goal is to conform us to the image of Christ, which often involves suffering, self-denial, and sacrifice. True joy comes as a fruit of obedience and right relationship with God, not as a result of pursuing happiness directly.",
      "supportingScriptures": [
        "Matthew 16:24-25 - \"Then Jesus told his disciples, 'If anyone would come after me, let him deny himself and take up his cross and follow me. For whoever would save his life will lose it, but whoever loses his life for my sake will find it.'\"",
        "Romans 8:28-29 - \"And we know that for those who love God all things work together for good, for those who are called according to his purpose. For those whom he foreknew he also predestined to be conformed to the image of his Son.\"",
        "Hebrews 12:5-11 - Discusses God's discipline which is painful in the moment but produces righteousness.",
        "James 1:2-4 - \"Count it all joy, my brothers, when you meet trials of various kinds, for you know that the testing of your faith produces steadfastness.\""
      ]
    },
    "category": "God's Character",
    "tags": ["happiness", "purpose", "suffering", "sanctification"]
  },
  {
    "id": "myth_2",
    "title": "God helps those who help themselves",
    "popularPerception": "This phrase is believed to be biblical and suggests that God only assists people who are already working hard and doing everything they can for themselves.",
    "biblicalCounterArgument": {
      "scripturalRefutation": "This phrase is not found anywhere in the Bible. In fact, scripture teaches the opposite - that God often helps those who cannot help themselves.",
      "contextualExplanation": "This saying comes from Benjamin Franklin's Poor Richard's Almanac, not scripture. It reflects American self-reliance and work ethic values rather than biblical teaching.",
      "soundDoctrine": "The Bible consistently teaches that God's grace is extended to the helpless, weak, and undeserving. Salvation itself is presented as God's gift to those who could never save themselves. While scripture does condemn laziness, it emphasizes our complete dependence on God rather than self-reliance.",
      "supportingScriptures": [
        "Romans 5:6-8 - \"For while we were still weak, at the right time Christ died for the ungodly... while we were still sinners, Christ died for us.\"",
        "Ephesians 2:8-9 - \"For by grace you have been saved through faith. And this is not your own doing; it is the gift of God, not a result of works, so that no one may boast.\"",
        "Psalm 46:1 - \"God is our refuge and strength, a very present help in trouble.\"",
        "2 Corinthians 12:9-10 - \"My grace is sufficient for you, for my power is made perfect in weakness.\""
      ]
    },
    "category": "God's Character",
    "tags": ["grace", "self-reliance", "dependence", "works"]
  },
  {
    "id": "myth_3",
    "title": "God won't give you more than you can handle",
    "popularPerception": "God carefully measures out trials and will never allow you to experience suffering beyond your personal ability to cope or overcome.",
    "biblicalCounterArgument": {
      "scripturalRefutation": "This common saying misinterprets 1 Corinthians 10:13, which specifically addresses temptation to sin, not general suffering or trials.",
      "contextualExplanation": "1 Corinthians 10:13 promises that God will provide a way of escape from temptation to sin, not that He won't allow suffering beyond our capacity. Many biblical figures were explicitly given challenges beyond their ability to handle alone.",
      "soundDoctrine": "God often allows believers to face circumstances far beyond their capacity to handle, specifically to teach dependence on Him rather than self-reliance. Paul himself wrote of being \"burdened beyond our strength\" (2 Cor 1:8). The biblical pattern shows God working through human weakness, not human strength.",
      "supportingScriptures": [
        "2 Corinthians 1:8-9 - \"For we were so utterly burdened beyond our strength that we despaired of life itself... But that was to make us rely not on ourselves but on God.\"",
        "Psalm 34:17-18 - \"When the righteous cry for help, the LORD hears and delivers them out of all their troubles. The LORD is near to the brokenhearted and saves the crushed in spirit.\"",
        "Matthew 11:28-30 - \"Come to me, all who labor and are heavy laden, and I will give you rest.\"",
        "Philippians 4:13 - \"I can do all things through him who strengthens me.\""
      ]
    },
    "category": "Suffering",
    "tags": ["trials", "endurance", "dependence", "suffering"]
  },
  {
    "id": "myth_4",
    "title": "You need to ask Jesus into your heart to be saved",
    "popularPerception": "Salvation comes through a prayer where you \"ask Jesus into your heart\" or \"accept Jesus as your personal Savior\" - phrases not found in scripture.",
    "biblicalCounterArgument": {
      "scripturalRefutation": "The Bible never instructs people to \"ask Jesus into their heart\" or \"accept Jesus as personal Savior.\" Instead, it calls for repentance, belief in the gospel, and confession of Jesus as Lord.",
      "contextualExplanation": "This phrase has become popular in modern evangelicalism but oversimplifies biblical salvation and can lead to false assurance based on having prayed a specific prayer rather than genuine faith and repentance.",
      "soundDoctrine": "Biblical salvation involves acknowledging sin, repenting (turning from sin), believing the gospel (Christ's death and resurrection), confessing Jesus as Lord, and following Him in obedience. While conversion is a moment, it manifests in a transformed life that perseveres in faith.",
      "supportingScriptures": [
        "Acts 2:38 - \"Repent and be baptized every one of you in the name of Jesus Christ for the forgiveness of your sins.\"",
        "Romans 10:9-10 - \"If you confess with your mouth that Jesus is Lord and believe in your heart that God raised him from the dead, you will be saved.\"",
        "Mark 1:15 - \"The time is fulfilled, and the kingdom of God is at hand; repent and believe in the gospel.\"",
        "Luke 9:23 - \"If anyone would come after me, let him deny himself and take up his cross daily and follow me.\""
      ]
    },
    "category": "Salvation",
    "tags": ["evangelism", "conversion", "repentance", "faith"]
  },
  {
    "id": "myth_5",
    "title": "When you die, you become an angel",
    "popularPerception": "After death, good people are transformed into angels who watch over their loved ones and serve God in heaven.",
    "biblicalCounterArgument": {
      "scripturalRefutation": "The Bible clearly distinguishes between humans and angels as separate created beings. Nowhere does scripture suggest humans transform into angels after death.",
      "contextualExplanation": "This belief stems from cultural sentimentalism and popular media rather than biblical teaching. Angels in scripture are created beings with specific roles, distinct from redeemed humans.",
      "soundDoctrine": "Angels and humans are separate created beings with different natures and purposes in God's plan. After death, believers go to be with Christ and will eventually receive glorified resurrection bodies at Christ's return - not angel bodies. The redeemed maintain their human identity, though transformed into Christ's likeness.",
      "supportingScriptures": [
        "Hebrews 1:14 - Angels are \"ministering spirits sent out to serve for the sake of those who are to inherit salvation\" - showing angels and saved humans are distinct.",
        "Hebrews 2:16 - \"For surely it is not angels that he helps, but he helps the offspring of Abraham.\"",
        "1 Corinthians 15:42-44 - Describes the resurrection body believers will receive, which is not an angelic body.",
        "Revelation 19:10 - An angel tells John, \"I am a fellow servant with you,\" distinguishing angels from redeemed humans."
      ]
    },
    "category": "Afterlife",
    "tags": ["death", "angels", "heaven", "resurrection"]
  },
  {
    "id": "myth_6",
    "title": "All good people go to heaven",
    "popularPerception": "If a person lives a generally good life, is kind to others, and doesn't commit major sins, they will go to heaven when they die.",
    "biblicalCounterArgument": {
      "scripturalRefutation": "The Bible teaches that salvation is by grace through faith in Jesus Christ alone, not by human goodness or works. All humanity is fallen and sinful, incapable of earning salvation.",
      "contextualExplanation": "This misconception stems from a human-centered view of morality rather than God's perfect standard of righteousness. It ignores the biblical teaching on original sin and the necessity of divine intervention for salvation.",
      "soundDoctrine": "No one is 'good enough' to earn heaven on their own. All have sinned and fall short of God's glory (Romans 3:23). Salvation is a gift of God, not a result of works, so that no one may boast (Ephesians 2:8-9). Entry into heaven requires the perfect righteousness of Christ, imputed to believers through faith.",
      "supportingScriptures": [
        "Romans 3:10-12 - \"None is righteous, no, not one; no one understands; no one seeks for God. All have turned aside; together they have become worthless; no one does good, not even one.\"",
        "Ephesians 2:8-9 - \"For by grace you have been saved through faith. And this is not your own doing; it is the gift of God, not a result of works, so that no one may boast.\"",
        "Titus 3:5 - \"He saved us, not because of works done by us in righteousness, but according to his own mercy.\"",
        "John 14:6 - \"Jesus said to him, 'I am the way, and the truth, and the life. No one comes to the Father except through me.'\""
      ]
    },
    "category": "Salvation",
    "tags": ["salvation", "works", "grace", "heaven", "sin"]
  },
  {
    "id": "myth_7",
    "title": "God accepts all religions as paths to Him",
    "popularPerception": "All religions are essentially different paths up the same mountain, leading to the same God. As long as you are sincere, God will accept your worship regardless of your faith tradition.",
    "biblicalCounterArgument": {
      "scripturalRefutation": "The Bible presents Jesus Christ as the exclusive way to God. It does not teach religious pluralism but rather the unique and singular truth of the Gospel.",
      "contextualExplanation": "This idea is a product of modern relativism and a desire for inclusivity, but it directly contradicts the exclusive claims of Christ and the apostles. The Bible consistently warns against false gods and false teachings.",
      "soundDoctrine": "While God is loving and desires all to come to repentance, He has revealed Himself definitively in Jesus Christ. Jesus Himself declared, 'I am the way, the truth, and the life; no one comes to the Father except through Me' (John 14:6). Any other path is a false path, and sincerity in a false religion does not make it true or acceptable to God.",
      "supportingScriptures": [
        "John 14:6 - \"Jesus said to him, 'I am the way, and the truth, and the life. No one comes to the Father except through me.'\"",
        "Acts 4:12 - \"And there is salvation in no one else, for there is no other name under heaven given among men by which we must be saved.\"",
        "1 Timothy 2:5 - \"For there is one God, and there is one mediator between God and men, the man Christ Jesus.\"",
        "Galatians 1:8-9 - \"But even if we or an angel from heaven should preach to you a gospel contrary to the one we preached to you, let him be accursed.\""
      ]
    },
    "category": "Theology Proper",
    "tags": ["pluralism", "exclusivity", "truth", "Jesus", "gospel"]
  },
  {
    "id": "myth_8",
    "title": "The Holy Spirit is primarily for emotional experiences and signs",
    "popularPerception": "The primary evidence of the Holy Spirit's presence in a believer's life is speaking in tongues, miraculous healings, or intense emotional experiences.",
    "biblicalCounterArgument": {
      "scripturalRefutation": "The Bible teaches that the Holy Spirit's primary work is to convict of sin, regenerate, indwell, sanctify, and empower believers for obedience and witness, producing the fruit of the Spirit.",
      "contextualExplanation": "This misconception often arises from a misreading of Acts and 1 Corinthians, focusing on extraordinary gifts while neglecting the Spirit's more fundamental and universal work in the life of every believer. It can lead to a pursuit of experiences over genuine spiritual transformation.",
      "soundDoctrine": "While the Holy Spirit can manifest in various ways, including some miraculous gifts, His essential work is to glorify Christ, apply salvation, and transform believers into Christ's likeness. The fruit of the Spirit (love, joy, peace, patience, kindness, goodness, faithfulness, gentleness, self-control) is the true and consistent evidence of His indwelling presence, not necessarily ecstatic experiences.",
      "supportingScriptures": [
        "Galatians 5:22-23 - \"But the fruit of the Spirit is love, joy, peace, patience, kindness, goodness, faithfulness, gentleness, self-control; against such things there is no law.\"",
        "John 16:8 - \"And when he comes, he will convict the world concerning sin and righteousness and judgment.\"",
        "Romans 8:9 - \"You, however, are not in the flesh but in the Spirit, if in fact the Spirit of God dwells in you. Anyone who does not have the Spirit of Christ does not belong to him.\"",
        "Acts 1:8 - \"But you will receive power when the Holy Spirit has come upon you, and you will be my witnesses in Jerusalem and in all Judea and Samaria, and to the end of the earth.\""
      ]
    },
    "category": "Holy Spirit",
    "tags": ["Holy Spirit", "spiritual gifts", "emotions", "fruit of the Spirit", "charismatic"]
  },
  {
    "id": "myth_9",
    "title": "Once saved, always saved, regardless of how one lives",
    "popularPerception": "Once a person genuinely accepts Christ, their salvation is eternally secure, and their subsequent behavior or lack of faith does not affect their eternal destiny.",
    "biblicalCounterArgument": {
      "scripturalRefutation": "While true believers are eternally secure in Christ, genuine saving faith is always accompanied by a transformed life and perseverance in obedience. A life characterized by unrepentant sin indicates a lack of true saving faith.",
      "contextualExplanation": "This misconception, often called 'easy-believism' or 'carnal Christianity,' divorces faith from repentance and obedience. It misinterprets biblical assurance as a license for sin, ignoring numerous warnings in Scripture about the necessity of perseverance and the evidence of true conversion.",
      "soundDoctrine": "True salvation is a work of God that guarantees perseverance. Those genuinely saved will persevere in faith and obedience, though they may stumble. The evidence of salvation is not merely a past decision but an ongoing transformed life that demonstrates a new nature and a desire to follow Christ. A person who claims to be saved but lives in continuous, unrepentant sin gives no biblical evidence of regeneration.",
      "supportingScriptures": [
        "Matthew 7:21 - \"Not everyone who says to me, 'Lord, Lord,' will enter the kingdom of heaven, but the one who does the will of my Father who is in heaven.\"",
        "James 2:17 - \"So also faith by itself, if it does not have works, is dead.\"",
        "1 John 2:3-4 - \"And by this we know that we have come to know him, if we keep his commandments. Whoever says 'I know him' but does not keep his commandments is a liar, and the truth is not in him.\"",
        "Philippians 2:12-13 - \"Therefore, my beloved, as you have always obeyed, so now, not only as in my presence but much more in my absence, work out your own salvation with fear and trembling, for it is God who works in you, both to will and to work for his good pleasure.\""
      ]
    },
    "category": "Salvation",
    "tags": ["eternal security", "perseverance", "easy-believism", "Lordship salvation", "obedience"]
  },
  {
    "id": "myth_10",
    "title": "God is too loving to send anyone to hell",
    "popularPerception": "A loving God would never condemn anyone to eternal punishment in hell. Eventually, everyone will be reconciled to God (universalism), or hell is not a literal place of eternal torment.",
    "biblicalCounterArgument": {
      "scripturalRefutation": "The Bible clearly teaches the reality of hell as a literal, eternal place of conscious punishment for those who reject God and His Son, Jesus Christ. God's love is balanced by His perfect justice and holiness.",
      "contextualExplanation": "This misconception often arises from a sentimentalized view of God's love that divorces it from His other attributes, particularly His holiness and justice. It ignores the severity of sin and the biblical warnings about judgment.",
      "soundDoctrine": "God is infinitely loving, but He is also perfectly holy and just. His justice demands punishment for sin. Hell is the just consequence for rebellion against a holy God. Jesus spoke more about hell than heaven, warning of its reality. Universalism (the belief that all will be saved) contradicts clear biblical teaching on judgment and the necessity of faith in Christ for salvation.",
      "supportingScriptures": [
        "Matthew 25:46 - \"And these will go away into eternal punishment, but the righteous into eternal life.\"",
        "Revelation 20:10 - \"and the devil who had deceived them was thrown into the lake of fire and sulfur where the beast and the false prophet were, and they will be tormented day and night forever and ever.\"",
        "2 Thessalonians 1:8-9 - \"...inflicting vengeance on those who do not know God and on those who do not obey the gospel of our Lord Jesus. They will suffer the punishment of eternal destruction, away from the presence of the Lord and from the glory of his might.\"",
        "John 3:18 - \"Whoever believes in him is not condemned, but whoever does not believe is condemned already, because he has not believed in the name of the only Son of God.\""
      ]
    },
    "category": "Afterlife",
    "tags": ["hell", "universalism", "justice", "love of God", "judgment"]
  }
]