[
  {
    "id": "myth_1",
    "title": "God wants me to be happy above all else",
    "popular_perception": "God's primary concern is my personal happiness and fulfillment. If something makes me happy, it must be God's will for my life.",
    "biblical_counter_argument": {
      "scriptural_refutation": "Scripture never promises happiness as God's primary goal for believers. Instead, it emphasizes holiness, obedience, and Christlikeness.",
      "contextual_explanation": "The modern focus on personal happiness as the ultimate goal is a cultural value, not a biblical one. Scripture consistently shows that God often calls people to difficult paths that don't immediately yield happiness.",
      "sound_doctrine": "God is more concerned with our holiness than our happiness. His ultimate goal is to conform us to the image of Christ, which often involves suffering, self-denial, and sacrifice. True joy comes as a fruit of obedience and right relationship with God, not as a result of pursuing happiness directly.",
      "supporting_scriptures": [
        "Matthew 16:24-25 - \"Then Jesus told his disciples, 'If anyone would come after me, let him deny himself and take up his cross and follow me. For whoever would save his life will lose it, but whoever loses his life for my sake will find it.'\"",
        "Romans 8:28-29 - \"And we know that for those who love God all things work together for good, for those who are called according to his purpose. For those whom he foreknew he also predestined to be conformed to the image of his Son.\"",
        "Hebrews 12:5-11 - Discusses God's discipline which is painful in the moment but produces righteousness.",
        "James 1:2-4 - \"Count it all joy, my brothers, when you meet trials of various kinds, for you know that the testing of your faith produces steadfastness.\""
      ]
    },
    "category": "God's Character",
    "tags": ["happiness", "purpose", "suffering", "sanctification"]
  },
  {
    "id": "myth_2",
    "title": "God helps those who help themselves",
    "popular_perception": "This phrase is believed to be biblical and suggests that God only assists people who are already working hard and doing everything they can for themselves.",
    "biblical_counter_argument": {
      "scriptural_refutation": "This phrase is not found anywhere in the Bible. In fact, scripture teaches the opposite - that God often helps those who cannot help themselves.",
      "contextual_explanation": "This saying comes from Benjamin Franklin's Poor Richard's Almanac, not scripture. It reflects American self-reliance and work ethic values rather than biblical teaching.",
      "sound_doctrine": "The Bible consistently teaches that God's grace is extended to the helpless, weak, and undeserving. Salvation itself is presented as God's gift to those who could never save themselves. While scripture does condemn laziness, it emphasizes our complete dependence on God rather than self-reliance.",
      "supporting_scriptures": [
        "Romans 5:6-8 - \"For while we were still weak, at the right time Christ died for the ungodly... while we were still sinners, Christ died for us.\"",
        "Ephesians 2:8-9 - \"For by grace you have been saved through faith. And this is not your own doing; it is the gift of God, not a result of works, so that no one may boast.\"",
        "Psalm 46:1 - \"God is our refuge and strength, a very present help in trouble.\"",
        "2 Corinthians 12:9-10 - \"My grace is sufficient for you, for my power is made perfect in weakness.\""
      ]
    },
    "category": "God's Character",
    "tags": ["grace", "self-reliance", "dependence", "works"]
  },
  {
    "id": "myth_3",
    "title": "God won't give you more than you can handle",
    "popular_perception": "God carefully measures out trials and will never allow you to experience suffering beyond your personal ability to cope or overcome.",
    "biblical_counter_argument": {
      "scriptural_refutation": "This common saying misinterprets 1 Corinthians 10:13, which specifically addresses temptation to sin, not general suffering or trials.",
      "contextual_explanation": "1 Corinthians 10:13 promises that God will provide a way of escape from temptation to sin, not that He won't allow suffering beyond our capacity. Many biblical figures were explicitly given challenges beyond their ability to handle alone.",
      "sound_doctrine": "God often allows believers to face circumstances far beyond their capacity to handle, specifically to teach dependence on Him rather than self-reliance. Paul himself wrote of being \"burdened beyond our strength\" (2 Cor 1:8). The biblical pattern shows God working through human weakness, not human strength.",
      "supporting_scriptures": [
        "2 Corinthians 1:8-9 - \"For we were so utterly burdened beyond our strength that we despaired of life itself... But that was to make us rely not on ourselves but on God.\"",
        "Psalm 34:17-18 - \"When the righteous cry for help, the LORD hears and delivers them out of all their troubles. The LORD is near to the brokenhearted and saves the crushed in spirit.\"",
        "Matthew 11:28-30 - \"Come to me, all who labor and are heavy laden, and I will give you rest.\"",
        "Philippians 4:13 - \"I can do all things through him who strengthens me.\""
      ]
    },
    "category": "Suffering",
    "tags": ["trials", "endurance", "dependence", "suffering"]
  },
  {
    "id": "myth_4",
    "title": "You need to ask Jesus into your heart to be saved",
    "popular_perception": "Salvation comes through a prayer where you \"ask Jesus into your heart\" or \"accept Jesus as your personal Savior\" - phrases not found in scripture.",
    "biblical_counter_argument": {
      "scriptural_refutation": "The Bible never instructs people to \"ask Jesus into their heart\" or \"accept Jesus as personal Savior.\" Instead, it calls for repentance, belief in the gospel, and confession of Jesus as Lord.",
      "contextual_explanation": "This phrase has become popular in modern evangelicalism but oversimplifies biblical salvation and can lead to false assurance based on having prayed a specific prayer rather than genuine faith and repentance.",
      "sound_doctrine": "Biblical salvation involves acknowledging sin, repenting (turning from sin), believing the gospel (Christ's death and resurrection), confessing Jesus as Lord, and following Him in obedience. While conversion is a moment, it manifests in a transformed life that perseveres in faith.",
      "supporting_scriptures": [
        "Acts 2:38 - \"Repent and be baptized every one of you in the name of Jesus Christ for the forgiveness of your sins.\"",
        "Romans 10:9-10 - \"If you confess with your mouth that Jesus is Lord and believe in your heart that God raised him from the dead, you will be saved.\"",
        "Mark 1:15 - \"The time is fulfilled, and the kingdom of God is at hand; repent and believe in the gospel.\"",
        "Luke 9:23 - \"If anyone would come after me, let him deny himself and take up his cross daily and follow me.\""
      ]
    },
    "category": "Salvation",
    "tags": ["evangelism", "conversion", "repentance", "faith"]
  },
  {
    "id": "myth_5",
    "title": "When you die, you become an angel",
    "popular_perception": "After death, good people are transformed into angels who watch over their loved ones and serve God in heaven.",
    "biblical_counter_argument": {
      "scriptural_refutation": "The Bible clearly distinguishes between humans and angels as separate created beings. Nowhere does scripture suggest humans transform into angels after death.",
      "contextual_explanation": "This belief stems from cultural sentimentalism and popular media rather than biblical teaching. Angels in scripture are created beings with specific roles, distinct from redeemed humans.",
      "sound_doctrine": "Angels and humans are separate created beings with different natures and purposes in God's plan. After death, believers go to be with Christ and will eventually receive glorified resurrection bodies at Christ's return - not angel bodies. The redeemed maintain their human identity, though transformed into Christ's likeness.",
      "supporting_scriptures": [
        "Hebrews 1:14 - Angels are \"ministering spirits sent out to serve for the sake of those who are to inherit salvation\" - showing angels and saved humans are distinct.",
        "Hebrews 2:16 - \"For surely it is not angels that he helps, but he helps the offspring of Abraham.\"",
        "1 Corinthians 15:42-44 - Describes the resurrection body believers will receive, which is not an angelic body.",
        "Revelation 19:10 - An angel tells John, \"I am a fellow servant with you,\" distinguishing angels from redeemed humans."
      ]
    },
    "category": "Afterlife",
    "tags": ["death", "angels", "heaven", "resurrection"]
  }
]