[
  {
    "id": "verse_1",
    "reference": "Philippians 4:13",
    "verse": "\"I can do all things through him who strengthens me.\"",
    "common_misuse": "Often used as a promise that Christians can accomplish anything they set their minds to with God's help, including physical feats, career goals, or personal ambitions.",
    "paragraph": "\"Not that I am speaking of being in need, for I have learned in whatever situation I am to be content. I know how to be brought low, and I know how to abound. In any and every circumstance, I have learned the secret of facing plenty and hunger, abundance and need. I can do all things through him who strengthens me.\" (Philippians 4:11-13)",
    "chapter_context": "Paul is writing from prison, thanking the Philippian church for their financial support. The entire passage is about contentment in all circumstances, whether in abundance or need, not about achieving personal goals or success.",
    "book_theme": "Philippians focuses on finding joy in Christ despite suffering, maintaining unity in the church, and having the mind of Christ (humility). Paul repeatedly emphasizes that suffering for Christ is a privilege, not something to be avoided.",
    "proper_interpretation": "This verse promises that Christ will give believers strength to endure all circumstances - whether poverty or wealth, suffering or comfort - with contentment and faithfulness. It's about spiritual endurance through any situation, not accomplishing whatever goals we set. Paul is specifically referring to his ability to endure both hardship and prosperity while remaining faithful to his calling."
  },
  {
    "id": "verse_2",
    "reference": "Jeremiah 29:11",
    "verse": "\"For I know the plans I have for you, declares the LORD, plans for welfare and not for evil, to give you a future and a hope.\"",
    "common_misuse": "Often quoted as a promise to individual Christians that God has a specific, prosperous plan for their personal lives and will not allow them to experience hardship.",
    "paragraph": "\"For thus says the LORD: When seventy years are completed for Babylon, I will visit you, and I will fulfill to you my promise and bring you back to this place. For I know the plans I have for you, declares the LORD, plans for welfare and not for evil, to give you a future and a hope. Then you will call upon me and come and pray to me, and I will hear you.\" (Jeremiah 29:10-12)",
    "chapter_context": "This was written to Israelites in Babylonian exile, not to individuals. The \"plans\" referred specifically to God's promise to restore Israel to their homeland after 70 years of captivity. The preceding verses even tell them to settle in Babylon, build houses, and seek Babylon's welfare - their immediate future included decades of exile.",
    "book_theme": "Jeremiah prophesied judgment on Judah for covenant unfaithfulness, predicted 70 years of exile, but also promised eventual restoration. The book emphasizes God's faithfulness to His covenant despite His people's unfaithfulness, and the promise of a new covenant (31:31-34).",
    "proper_interpretation": "This verse assures God's covenant people that despite the judgment of exile, He had not abandoned them and would restore them according to His promise. While Christians can take comfort in God's faithfulness to His promises and His good intentions toward His people, this verse doesn't guarantee prosperity or absence of hardship for individuals. The plans referenced were specific to Israel's national restoration from exile."
  },
  {
    "id": "verse_3",
    "reference": "Matthew 7:1",
    "verse": "\"Judge not, that you be not judged.\"",
    "common_misuse": "Commonly cited to claim that Christians should never make moral evaluations of others' actions or beliefs, or to silence any criticism or discernment.",
    "paragraph": "\"Judge not, that you be not judged. For with the judgment you pronounce you will be judged, and with the measure you use it will be measured to you. Why do you see the speck that is in your brother's eye, but do not notice the log that is in your own eye?\" (Matthew 7:1-3)",
    "chapter_context": "This appears in Jesus' Sermon on the Mount, in a section addressing righteous living. Jesus goes on to speak of removing the log from your own eye so you can see clearly to remove the speck from your brother's eye (v.5), and warns against giving \"what is holy to dogs\" (v.6) - both requiring moral discernment.",
    "book_theme": "Matthew presents Jesus as the promised Messiah who fulfills Old Testament prophecies and who teaches the true meaning of God's law. Jesus consistently opposes hypocrisy and external religion while calling for genuine righteousness that exceeds that of the Pharisees.",
    "proper_interpretation": "Jesus prohibits hypocritical, self-righteous, or condemning judgment, not all moral evaluation. He's warning against judging others by standards we don't apply to ourselves, or assuming God's role of final judgment. Elsewhere, Jesus explicitly commands righteous judgment (John 7:24) and other New Testament passages clearly call believers to exercise moral discernment and even church discipline (1 Cor. 5:9-13; Gal. 6:1)."
  },
  {
    "id": "verse_4",
    "reference": "Romans 8:28",
    "verse": "\"And we know that for those who love God all things work together for good, for those who are called according to his purpose.\"",
    "common_misuse": "Often used to suggest that everything pleasant or unpleasant that happens to believers will work out for their immediate happiness or preference.",
    "paragraph": "\"And we know that for those who love God all things work together for good, for those who are called according to his purpose. For those whom he foreknew he also predestined to be conformed to the image of his Son, in order that he might be the firstborn among many brothers.\" (Romans 8:28-29)",
    "chapter_context": "Romans 8 focuses on life in the Spirit and addresses suffering extensively. Paul acknowledges that creation groans, believers groan, and even the Spirit groans as we await final redemption. This promise comes in a context of suffering, not prosperity.",
    "book_theme": "Romans systematically explains the gospel, addressing sin, justification by faith, sanctification, election, and God's plan for Israel and Gentiles. It emphasizes that salvation is by grace through faith, not works, and explains how the gospel transforms individuals and communities.",
    "proper_interpretation": "This verse promises that God sovereignly works all circumstances - including suffering, persecution, and hardship - toward the ultimate spiritual good of believers. The \"good\" is defined in the next verse: conformity to Christ's image. God uses all things, even painful things, to make us more like Jesus. It's not a promise of immediate comfort or that everything will happen according to our desires, but that God works all things toward our ultimate Christlikeness and eternal good."
  },
  {
    "id": "verse_5",
    "reference": "Malachi 3:10",
    "verse": "\"Bring the full tithe into the storehouse, that there may be food in my house. And thereby put me to the test, says the LORD of hosts, if I will not open the windows of heaven for you and pour down for you a blessing until there is no more need.\"",
    "common_misuse": "Often used to promise financial prosperity to Christians who give exactly 10% of their income to their local church, or to claim tithing is mandatory for New Testament believers.",
    "paragraph": "\"Will man rob God? Yet you are robbing me. But you say, 'How have we robbed you?' In your tithes and contributions. You are cursed with a curse, for you are robbing me, the whole nation of you. Bring the full tithe into the storehouse, that there may be food in my house. And thereby put me to the test, says the LORD of hosts, if I will not open the windows of heaven for you and pour down for you a blessing until there is no more need.\" (Malachi 3:8-10)",
    "chapter_context": "Malachi addresses specific covenant violations by Israel and its priests. This passage specifically addressed the nation of Israel, who were withholding required tithes under the Mosaic covenant. The tithes supplied food for the Levites and priests who couldn't own land.",
    "book_theme": "Malachi confronts post-exilic Israel for covenant unfaithfulness in several areas, including improper worship, divorce, and withholding tithes. It warns of judgment while looking forward to the coming messenger who will prepare the way for the Lord.",
    "proper_interpretation": "This passage called covenant Israel to obedience to the Mosaic Law's tithing requirements, promising national blessing for obedience. While the principle of generous, proportional giving remains in the New Testament (1 Cor. 16:2; 2 Cor. 9:6-7), the specific tithing system was part of Israel's covenant. New Testament giving is motivated by grace, not law, and is to be done cheerfully, not under compulsion. The passage doesn't guarantee individual financial prosperity to Christians who tithe."
  }
]