[
  {
    "id": "verse_1",
    "reference": "Philippians 4:13",
    "verse": "\"I can do all things through him who strengthens me.\"",
    "commonMisuse": "Often used as a promise that Christians can accomplish anything they set their minds to with God's help, including physical feats, career goals, or personal ambitions. Frequently quoted to support prosperity theology or to encourage people to pursue worldly success.",
    "paragraph": "\"Not that I am speaking of being in need, for I have learned in whatever situation I am to be content. I know how to be brought low, and I know how to abound. In any and every circumstance, I have learned the secret of facing plenty and hunger, abundance and need. I can do all things through him who strengthens me. Yet it was kind of you to share my trouble.\" (Philippians 4:11-14)",
    "chapterContext": "Paul is writing from prison, thanking the Philippian church for their financial support during his imprisonment. The entire passage is about contentment in all circumstances, whether in abundance or need, not about achieving personal goals or success. Paul is specifically addressing his ability to endure hardship and remain content regardless of external circumstances.",
    "bookTheme": "Philippians focuses on finding joy in Christ despite suffering, maintaining unity in the church, and having the mind of Christ (humility and service). Paul repeatedly emphasizes that suffering for Christ is a privilege, not something to be avoided. The book teaches that true joy comes from knowing Christ, not from favorable circumstances.",
    "properInterpretation": "This verse promises that Christ will give believers strength to endure all circumstances - whether poverty or wealth, suffering or comfort - with contentment and faithfulness. It's about spiritual endurance through any situation, not accomplishing whatever goals we set. Paul is specifically referring to his ability to endure both hardship and prosperity while remaining faithful to his calling and content in God's provision."
  },
  {
    "id": "verse_2",
    "reference": "Jeremiah 29:11",
    "verse": "\"For I know the plans I have for you, declares the LORD, plans for welfare and not for evil, to give you a future and a hope.\"",
    "commonMisuse": "Often quoted as a promise to individual Christians that God has a specific, prosperous plan for their personal lives and will not allow them to experience hardship. Used to support prosperity theology and the idea that God wants all believers to be successful and happy.",
    "paragraph": "\"For thus says the LORD: When seventy years are completed for Babylon, I will visit you, and I will fulfill to you my promise and bring you back to this place. For I know the plans I have for you, declares the LORD, plans for welfare and not for evil, to give you a future and a hope. Then you will call upon me and come and pray to me, and I will hear you. You will seek me and find me, when you seek me with all your heart.\" (Jeremiah 29:10-13)",
    "chapterContext": "This was written to Israelites in Babylonian exile, not to individuals. The 'plans' referred specifically to God's promise to restore Israel to their homeland after 70 years of captivity. The preceding verses even tell them to settle in Babylon, build houses, and seek Babylon's welfare - their immediate future included decades of exile and hardship.",
    "bookTheme": "Jeremiah prophesied judgment on Judah for covenant unfaithfulness, predicted 70 years of exile, but also promised eventual restoration. The book emphasizes God's faithfulness to His covenant despite His people's unfaithfulness, and the promise of a new covenant (31:31-34). It shows that God's plans often include discipline and suffering for ultimate good.",
    "properInterpretation": "This verse assures God's covenant people that despite the judgment of exile, He had not abandoned them and would restore them according to His promise. While Christians can take comfort in God's faithfulness to His promises and His good intentions toward His people, this verse doesn't guarantee prosperity or absence of hardship for individuals. The plans referenced were specific to Israel's national restoration from exile after a period of divine judgment."
  },
  {
    "id": "verse_3",
    "reference": "Matthew 7:1",
    "verse": "\"Judge not, that you be not judged.\"",
    "commonMisuse": "Commonly cited to claim that Christians should never make moral evaluations of others' actions or beliefs, or to silence any criticism or discernment. Used to shut down biblical correction, church discipline, or any form of moral accountability.",
    "paragraph": "\"Judge not, that you be not judged. For with the judgment you pronounce you will be judged, and with the measure you use it will be measured to you. Why do you see the speck that is in your brother's eye, but do not notice the log that is in your own eye? Or how can you say to your brother, 'Let me take the speck out of your eye,' when there is the log in your own eye? You hypocrite, first take the log out of your own eye, and then you will see clearly to take the speck out of your brother's eye.\" (Matthew 7:1-5)",
    "chapterContext": "This appears in Jesus' Sermon on the Mount, in a section addressing righteous living. Jesus goes on to speak of removing the log from your own eye so you can see clearly to remove the speck from your brother's eye (v.5), and warns against giving 'what is holy to dogs' (v.6) - both requiring moral discernment. The context actually encourages proper judgment after self-examination.",
    "bookTheme": "Matthew presents Jesus as the promised Messiah who fulfills Old Testament prophecies and who teaches the true meaning of God's law. Jesus consistently opposes hypocrisy and external religion while calling for genuine righteousness that exceeds that of the Pharisees. The book emphasizes the importance of both mercy and justice.",
    "properInterpretation": "Jesus prohibits hypocritical, self-righteous, or condemning judgment, not all moral evaluation. He's warning against judging others by standards we don't apply to ourselves, or assuming God's role of final judgment. Elsewhere, Jesus explicitly commands righteous judgment (John 7:24) and other New Testament passages clearly call believers to exercise moral discernment and even church discipline (1 Cor. 5:9-13; Gal. 6:1). The goal is restoration, not condemnation."
  },
  {
    "id": "verse_4",
    "reference": "Romans 8:28",
    "verse": "\"And we know that for those who love God all things work together for good, for those who are called according to his purpose.\"",
    "commonMisuse": "Often used to suggest that everything pleasant or unpleasant that happens to believers will work out for their immediate happiness or preference. Misused to minimize suffering or to claim that bad things aren't really bad if you have enough faith.",
    "paragraph": "\"Likewise the Spirit helps us in our weakness. For we do not know what to pray for as we ought, but the Spirit himself intercedes for us with groanings too deep for words. And he who searches hearts knows what is the mind of the Spirit, because the Spirit intercedes for the saints according to the will of God. And we know that for those who love God all things work together for good, for those who are called according to his purpose. For those whom he foreknew he also predestined to be conformed to the image of his Son, in order that he might be the firstborn among many brothers.\" (Romans 8:26-29)",
    "chapterContext": "Romans 8 focuses on life in the Spirit and addresses suffering extensively. Paul acknowledges that creation groans, believers groan, and even the Spirit groans as we await final redemption. This promise comes in a context of suffering, not prosperity. The chapter emphasizes our future hope and present help through the Spirit.",
    "bookTheme": "Romans systematically explains the gospel, addressing sin, justification by faith, sanctification, election, and God's plan for Israel and Gentiles. It emphasizes that salvation is by grace through faith, not works, and explains how the gospel transforms individuals and communities. The book shows that suffering is part of the Christian experience.",
    "properInterpretation": "This verse promises that God sovereignly works all circumstances - including suffering, persecution, and hardship - toward the ultimate spiritual good of believers. The 'good' is defined in the next verse: conformity to Christ's image. God uses all things, even painful things, to make us more like Jesus. It's not a promise of immediate comfort or that everything will happen according to our desires, but that God works all things toward our ultimate Christlikeness and eternal good."
  },
  {
    "id": "verse_5",
    "reference": "Malachi 3:10",
    "verse": "\"Bring the full tithe into the storehouse, that there may be food in my house. And thereby put me to the test, says the LORD of hosts, if I will not open the windows of heaven for you and pour down for you a blessing until there is no more need.\"",
    "commonMisuse": "Often used to promise financial prosperity to Christians who give exactly 10% of their income to their local church, or to claim tithing is mandatory for New Testament believers. Used to support prosperity theology and to manipulate people into giving through promises of material return.",
    "paragraph": "\"Will man rob God? Yet you are robbing me. But you say, 'How have we robbed you?' In your tithes and contributions. You are cursed with a curse, for you are robbing me, the whole nation of you. Bring the full tithe into the storehouse, that there may be food in my house. And thereby put me to the test, says the LORD of hosts, if I will not open the windows of heaven for you and pour down for you a blessing until there is no more need. I will rebuke the devourer for you, so that it will not destroy the fruits of your soil, and your vine in the field shall not fail to bear, says the LORD of hosts.\" (Malachi 3:8-11)",
    "chapterContext": "Malachi addresses specific covenant violations by Israel and its priests. This passage specifically addressed the nation of Israel, who were withholding required tithes under the Mosaic covenant. The tithes supplied food for the Levites and priests who couldn't own land. The blessings promised were agricultural and national, not individual financial prosperity.",
    "bookTheme": "Malachi confronts post-exilic Israel for covenant unfaithfulness in several areas, including improper worship, divorce, and withholding tithes. It warns of judgment while looking forward to the coming messenger who will prepare the way for the Lord. The book emphasizes God's unchanging nature and His desire for faithful worship.",
    "properInterpretation": "This passage called covenant Israel to obedience to the Mosaic Law's tithing requirements, promising national blessing for obedience. While the principle of generous, proportional giving remains in the New Testament (1 Cor. 16:2; 2 Cor. 9:6-7), the specific tithing system was part of Israel's covenant. New Testament giving is motivated by grace, not law, and is to be done cheerfully, not under compulsion. The passage doesn't guarantee individual financial prosperity to Christians who tithe."
  },
  {
    "id": "verse_6",
    "reference": "Isaiah 55:11",
    "verse": "\"So shall my word be that goes out from my mouth; it shall not return to me empty, but it shall accomplish that which I purpose, and shall succeed in the thing for which I sent it.\"",
    "commonMisuse": "Often used to support the 'name it and claim it' theology, suggesting that if we speak God's promises aloud, they will automatically come to pass. Misused to teach that positive confession or speaking Bible verses guarantees specific outcomes.",
    "paragraph": "\"For as the rain and the snow come down from heaven and do not return there but water the earth, making it bring forth and sprout, giving seed to the sower and bread to the eater, so shall my word be that goes out from my mouth; it shall not return to me empty, but it shall accomplish that which I purpose, and shall succeed in the thing for which I sent it. For you shall go out in joy and be led forth in peace; the mountains and the hills before you shall break forth into singing, and all the trees of the field shall clap their hands.\" (Isaiah 55:10-12)",
    "chapterContext": "This passage is about God's promise to restore Israel from exile. The context is God's invitation to come to Him for salvation and His assurance that His word of promise will accomplish His purposes. It's not about human confession or claiming promises, but about God's sovereign power to fulfill His declared intentions.",
    "bookTheme": "Isaiah prophesies both judgment and restoration for Israel. The book emphasizes God's sovereignty, holiness, and faithfulness to His covenant promises. It contains numerous messianic prophecies and demonstrates God's control over history and nations. The theme is God's salvation plan unfolding according to His purposes.",
    "properInterpretation": "This verse assures us that God's word will accomplish His intended purposes, not necessarily our desired outcomes. It speaks of God's sovereignty in fulfilling His promises and plans, not about the power of human confession or positive thinking. When God speaks a word of promise or judgment, it will certainly come to pass according to His timing and purposes. This gives us confidence in Scripture's reliability and God's faithfulness, not a formula for getting what we want."
  },
  {
    "id": "verse_7",
    "reference": "Proverbs 31:6",
    "verse": "\"Give strong drink to the one who is perishing, and wine to those in bitter distress.\"",
    "commonMisuse": "Sometimes used to justify excessive drinking or to argue that the Bible endorses alcohol consumption without limits. Taken out of context to support drinking as a solution to problems or stress.",
    "paragraph": "\"It is not for kings, O Lemuel, it is not for kings to drink wine, or for rulers to take strong drink, lest they drink and forget what has been decreed and pervert the rights of all the afflicted. Give strong drink to the one who is perishing, and wine to those in bitter distress; let them drink and forget their poverty and remember their misery no more. Open your mouth for the mute, for the rights of all who are destitute.\" (Proverbs 31:4-8)",
    "chapterContext": "This is advice from King Lemuel's mother about the responsibilities of leadership. She warns against rulers drinking because it impairs judgment and leads to injustice. The instruction to give strong drink to the perishing is in the context of end-of-life care or extreme suffering, not recreational drinking or stress relief.",
    "bookTheme": "Proverbs emphasizes wisdom, righteousness, and the fear of the Lord as the foundation for successful living. It contrasts the way of wisdom with the way of folly, showing the consequences of both. The book teaches practical godliness and the importance of self-control and good judgment.",
    "properInterpretation": "This passage teaches that those in positions of responsibility should avoid alcohol because it impairs judgment and can lead to injustice. The reference to giving strong drink to the perishing likely refers to medicinal use for those in extreme pain or at the point of death (similar to the wine mixed with myrrh offered to Jesus on the cross). It's not an endorsement of drinking to escape problems, but rather shows compassion for those in terminal suffering while maintaining the principle that leaders need clear judgment."
  },
  {
    "id": "verse_8",
    "reference": "1 Corinthians 10:13",
    "verse": "\"No temptation has overtaken you that is not common to man. God is faithful, and he will not let you be tempted beyond your ability, but with the temptation he will also provide the way of escape, that you may be able to endure it.\"",
    "commonMisuse": "Often misapplied to general suffering and trials, with people saying 'God won't give you more than you can handle.' Used to minimize others' pain or to suggest that struggling with difficulties indicates lack of faith.",
    "paragraph": "\"Therefore, my beloved, flee from idolatry. I speak as to sensible people; judge for yourselves what I say. The cup of blessing that we bless, is it not a participation in the blood of Christ? The bread that we break, is it not a participation in the body of Christ? Because there is one bread, we who are many are one body, for we all partake of the one bread. Consider the people of Israel: are not those who eat the sacrifices participants in the altar? What do I imply then? That food offered to idols is anything, or that an idol is anything? No, I imply that what pagans sacrifice they offer to demons and not to God. I do not want you to be participants with demons. You cannot drink the cup of the Lord and the cup of demons. You cannot partake of the table of the Lord and the table of demons. Shall we provoke the Lord to jealousy? Are we stronger than he? 'All things are lawful,' but not all things are helpful. 'All things are lawful,' but not all things build up. No temptation has overtaken you that is not common to man. God is faithful, and he will not let you be tempted beyond your ability, but with the temptation he will also provide the way of escape, that you may be able to endure it.\" (1 Corinthians 10:14-13)",
    "chapterContext": "Paul is specifically addressing temptation to sin, particularly the temptation to participate in idolatrous practices. The context is about moral choices and the temptation to compromise with pagan culture. This is not about general suffering or life's difficulties, but about moral temptation and the believer's ability to resist sin.",
    "bookTheme": "1 Corinthians addresses various problems in the Corinthian church, including divisions, immorality, and compromise with pagan culture. Paul emphasizes the importance of holiness, unity, and proper Christian conduct. The book shows how the gospel should transform both individual behavior and church life.",
    "properInterpretation": "This verse specifically promises that God will provide a way of escape from temptation to sin, not from all suffering or difficulties. It assures believers that no moral temptation is so strong that it cannot be resisted through God's help. The 'way of escape' refers to God's provision for avoiding sin, not deliverance from all hardship. Paul himself wrote elsewhere about being 'burdened beyond our strength' (2 Cor. 1:8), showing that this verse doesn't apply to general suffering."
  },
  {
    "id": "verse_9",
    "reference": "Matthew 18:20",
    "verse": "\"For where two or three are gathered in my name, there am I among them.\"",
    "commonMisuse": "Often used to suggest that Jesus is only present when multiple people gather, or that small group meetings automatically have special spiritual power. Sometimes used to justify informal worship or to minimize the importance of larger church gatherings.",
    "paragraph": "\"If your brother sins against you, go and tell him his fault, between you and him alone. If he listens to you, you have gained your brother. But if he does not listen, take one or two others along with you, that every charge may be established by the evidence of two or three witnesses. If he refuses to listen to them, tell it to the church. And if he refuses to listen even to the church, let him be to you as a Gentile and a tax collector. Truly, I say to you, whatever you bind on earth shall be bound in heaven, and whatever you loose on earth shall be loosed in heaven. Again I say to you, if two of you agree on earth about anything they ask, it will be done for them by my Father in heaven. For where two or three are gathered in my name, there am I among them.\" (Matthew 18:15-20)",
    "chapterContext": "This passage is specifically about church discipline and the process of confronting sin within the church community. Jesus is giving instructions on how to handle conflicts and restore wayward believers. The 'two or three gathered' refers to the witnesses in the discipline process and the church's authority in making decisions about fellowship.",
    "bookTheme": "Matthew emphasizes Jesus as the promised Messiah and King, presenting His teachings about the kingdom of heaven. The book includes extensive teaching about church life, discipleship, and the authority Jesus gives to His followers. It shows Jesus as both gentle shepherd and righteous judge.",
    "properInterpretation": "In context, this verse assures the church that Jesus supports and validates the decisions made in the church discipline process when conducted according to His instructions. It's not primarily about Jesus' general presence (He is omnipresent), but about His special endorsement of the church's authority in matters of discipline and restoration. While Jesus is indeed present wherever believers gather, this specific promise relates to the church's judicial authority in dealing with sin and maintaining fellowship."
  },
  {
    "id": "verse_10",
    "reference": "Revelation 3:20",
    "verse": "\"Behold, I stand at the door and knock. If anyone hears my voice and opens the door, I will come in to him and eat with him, and he with me.\"",
    "commonMisuse": "Commonly used in evangelistic contexts to suggest that Jesus is knocking on the hearts of unbelievers, waiting for them to 'invite Him in' for salvation. Used to support the idea that salvation depends on human decision rather than God's sovereign grace.",
    "paragraph": "\"I know your works: you are neither cold nor hot. Would that you were either cold or hot! So, because you are lukewarm, and neither hot nor cold, I will spit you out of my mouth. For you say, I am rich, I have prospered, and I need nothing, not realizing that you are wretched, pitiable, poor, blind, and naked. I counsel you to buy from me gold refined by fire, so that you may be rich, and white garments so that you may clothe yourself and the shame of your nakedness may not be seen, and salve to anoint your eyes, so that you may see. Those whom I love, I reprove and discipline, so be zealous and repent. Behold, I stand at the door and knock. If anyone hears my voice and opens the door, I will come in to him and eat with him, and he with me.\" (Revelation 3:15-20)",
    "chapterContext": "This is Jesus' message to the church in Laodicea, a church that was spiritually lukewarm and self-satisfied. The context is church discipline and a call to repentance for believers who had become complacent. Jesus is calling the church back to fellowship with Him, not offering initial salvation to unbelievers.",
    "bookTheme": "Revelation reveals Jesus Christ in His glory and presents His messages to the seven churches, followed by visions of the end times. The book emphasizes Christ's sovereignty, the certainty of His return, and the ultimate victory of God's kingdom. It calls believers to faithfulness despite persecution.",
    "properInterpretation": "This verse is addressed to a lukewarm church, calling them to repentance and renewed fellowship with Christ. It's about restoration of believers who have drifted from close relationship with Jesus, not about initial salvation. The 'door' represents the entrance to renewed fellowship and intimacy with Christ. While the principle of responding to Christ's call can apply to unbelievers, the immediate context is about believers returning to fervent devotion and obedience."
  }
]