[
  {
    "number": 1,
    "text": "Now the serpent was more cunning than any beast of the field which the LORD God had made. And he said to the woman, \"Has God indeed said, 'You shall not eat of every tree of the garden'?\"",
    "explanation": "The serpent introduces doubt about God's word through a subtle question that distorts what God actually said. This is the first recorded temptation in human history."
  },
  {
    "number": 2,
    "text": "And the woman said to the serpent, \"We may eat the fruit of the trees of the garden;\"",
    "explanation": "Eve begins to engage with the tempter, showing she knows God's provision but is about to be led into error."
  },
  {
    "number": 3,
    "text": "\"but of the fruit of the tree which is in the midst of the garden, God has said, 'You shall not eat it, nor shall you touch it, lest you die.'\"",
    "explanation": "Eve adds to God's command (God never said not to touch it), showing how temptation can lead us to either diminish or add to God's word."
  },
  {
    "number": 4,
    "text": "Then the serpent said to the woman, \"You will not surely die.\"",
    "explanation": "The serpent directly contradicts God's word, calling God a liar. This is the essence of all temptation - to doubt God's truthfulness."
  },
  {
    "number": 5,
    "text": "\"For God knows that when you eat of it your eyes will be opened, and you will be like God, knowing good and evil.\"",
    "explanation": "The tempter promises godlike knowledge and status, appealing to pride and the desire for autonomy from God."
  },
  {
    "number": 6,
    "text": "So when the woman saw that the tree was good for food, that it was pleasant to the eyes, and a tree desirable to make one wise, she took of its fruit and ate. She also gave to her husband with her, and he ate.",
    "explanation": "The three aspects of temptation: lust of the flesh (good for food), lust of the eyes (pleasant to the eyes), and pride of life (desirable to make wise). Adam was present and failed to protect his wife."
  },
  {
    "number": 7,
    "text": "Then the eyes of both of them were opened, and they knew that they were naked; and they sewed fig leaves together and made themselves coverings.",
    "explanation": "Sin brings shame and the attempt to cover ourselves through our own efforts rather than trusting in God's provision."
  },
  {
    "number": 8,
    "text": "And they heard the sound of the LORD God walking in the garden in the cool of the day, and Adam and his wife hid themselves from the presence of the LORD God among the trees of the garden.",
    "explanation": "Sin breaks fellowship with God and creates fear where there was once intimate communion."
  },
  {
    "number": 9,
    "text": "Then the LORD God called to Adam and said to him, \"Where are you?\"",
    "explanation": "God seeks out the fallen couple, not because He doesn't know where they are, but to give them opportunity to confess and repent."
  },
  {
    "number": 15,
    "text": "And I will put enmity between you and the woman, and between your seed and her Seed; He shall bruise your head, and you shall bruise His heel.",
    "explanation": "The first promise of redemption (protoevangelium) - the woman's seed (Christ) will ultimately defeat the serpent (Satan), though it will cost Him greatly."
  },
  {
    "number": 21,
    "text": "Also for Adam and his wife the LORD God made tunics of skin, and clothed them.",
    "explanation": "God provides proper covering for their shame through the death of animals - the first sacrifice, pointing to the ultimate sacrifice of Christ."
  },
  {
    "number": 24,
    "text": "So He drove out the man; and He placed cherubim at the east of the garden of Eden, and a flaming sword which turned every way, to guard the way to the tree of life.",
    "explanation": "God prevents access to the tree of life in their fallen state - an act of mercy to prevent them from living forever in sin. The way back to life must come through redemption."
  }
]